{
  "id": "covert-cargo",
  "settingId": "realm-of-myr",
  "title": "Covert Cargo",
  "author": "D20Adventures",
  "version": "1716220800",
  "teaser": "A mysterious summons from an old druid friend draws a reclusive ranger into the wilds of the Valkarr forest.",
  "overview": "Thalbern, a ranger of the Valkarr woods, is called upon by his old friend, the druid Wollandora, to meet him at the Old Standing Stones at midnight. The balance of the forest could depend on it.",
  "party": [1, 1],
  "image": "images/settings/realm-of-myr/the-midnight-summons/the-midnight-summons.png",
  "sections": [
    {
      "title": "Journey to the Standing Stones",
      "summary": "Thalbern receives an urgent message and ventures to meet the druid Wollandora, facing an unexpected danger along the way.",
      "scenes": [
        {
          "title": "Path Through The Dark Forest",
          "summary": "Thalbern answers Wollandora's call, navigating the dark forest towards the ancient meeting place.",
          "encounters": [
            {
              "id": "broken-silence",
              "title": "Broken Silence",
              "intro": "Thalbern, a solitary ranger of the Valkarr woods, has always trusted the silence of the wilds more than the promises of men. Orphaned by border raiders and raised by the elves of the Valkrarr Forest, he has spent years living on the edge of Kordavos, guiding travelers, hunting for his own survival, and keeping his distance from the tangled politics of the city.\n\nYet on this night, a message delivered by a red squirrel bearing the unmistakable script of Wollandora, a trusted elven friend and druid, has drawn him from his hidden home. The note was simple and urgent: Meet me at the Old Standing Stones at midnight. The balance of the forest could depend on it.\n\nNow, as midnight approaches, Thalbern moves quietly through the dense undergrowth, guided by memory and instinct. It is dark with almost no moonlight coming through the forest canopy.\n\nSuddenly, the hush of the night is broken by a sharp crack. Something large has just stepped on a branch somewhere off in the distance.",
              "instructions": "A perception check is appropriate if Thalbern investigates (low difficulty with a plus 3 modifier). If successful, he will determine it is a large creature that is approaching quickly. With a high roll (18+), he will determine it is an Owlbear. If combat ensues and Thalbern is below 25% health, Wollandora will intervene. If Thalbern avoids or defeats the Owlbear, or if Wollandora saves him, he proceeds to the Old Standing Stones.",
              "image": "images/settings/realm-of-myr/the-midnight-summons/broken-silence-2.png",
              "transitions": [
                {
                  "condition": "If Thalbern successfully rolls to hide or evade and can avoid the Owlbear, go to meeting-at-the-stones.",
                  "encounter": "meeting-at-the-stones"
                },
                {
                  "condition": "If Thalbern fails any dice roll (including stealth, perception, or any other check) or does nothing requiring a roll, advance to owlbear-confrontation.",
                  "encounter": "owlbear-confrontation"
                },
                {
                  "condition": "If Thalbern has a healthPercent of less than 50%, go to wollandora-intervention.",
                  "encounter": "wollandora-intervention"
                }
              ]
            },
            {
              "id": "owlbear-confrontation",
              "title": "Owlbear Confrontation",
              "intro": "From the direction of the sound, a little bit of eye shine glints in the shadows of the tree line. A hulking fifteen foot tall monster with the body of a giant bear and the head of an owl. As it crashes out from the undergrowth, it lets out a guttural squawk, clearly agitated and territorial.",
              "instructions": "The Owlbear will attack. If Thalbern attempts an animal handling check (high difficulty) and succeeds, he can move past the Owlbear. If Thalbern wins initiative and attempts to hide, he can move past the Owlbear if he passes a medium difficulty stealth check. If Thalbern's health drops to a critical level, Wollandora appears and drives off the Owlbear, transitioning to 'wollandora-intervention'. If Thalbern defeats the Owlbear, describe his victory and transition to 'meeting-at-the-stones'.",
              "image": "images/settings/realm-of-myr/the-midnight-summons/owlbear-confrontation.png",
              "npc": [
                {
                  "id": "owlbear",
                  "behavior": "Aggressively attacks any perceived threat. Will fight until heavily wounded or driven off.",
                  "initialInitiative": 1
                }
              ],
              "transitions": [
                {
                  "condition": "Thalbern defeats the Owlbear, manages to evade it, successfully uses Animal Handling to pacify and move past it, or successfully rolls any other way to move past it.",
                  "encounter": "meeting-at-the-stones"
                },
                {
                  "condition": "Thalbern is reduced to critical health by the Owlbear.",
                  "encounter": "timely-rescue"
                }
              ]
            },
            {
              "id": "timely-rescue",
              "title": "Timely Rescue",
              "intro": "Just as the Owlbear is about to land a seemingly final blow, a shaft of silvery moonlight pierces the canopy. A calm, authoritative voice calls out, 'That's enough, beast of the wood!' Wollandora steps from the shadows, her staff glowing faintly. With a gesture and a word of power, she unleashes a wave of natural energy that stuns and drives the startled Owlbear back into the depths of the forest.",
              "instructions": "Wollandora quickly checks on Thalbern's condition. She'll offer a brief comment ('You look like you've seen better nights, ranger. Come, the stones are not far, and our business is urgent.'). She then leads him to the Standing Stones.",
              "image": "images/settings/realm-of-myr/the-midnight-summons/timely-rescue.png",
              "npc": [
                {
                  "id": "wollandora",
                  "behavior": "Protective of Thalbern, focused on getting to the meeting."
                }
              ],
              "transitions": [
                {
                  "condition": "Thalbern is able to go to the Standing Stones with Wollandora.",
                  "encounter": "meeting-at-the-stones"
                }
              ]
            },
            {
              "id": "meeting-at-the-stones",
              "title": "Meeting at the Stones",
              "intro": "Thalbern arrives at the ancient Standing Stones. The air is thick with anticipation as the moonlight bathes the clearing in a silvery glow.\n\n\"Thalbern, thank you for coming. The forest is grateful for your swiftness,\" Wollandora intones, her voice echoing softly in the stillness. The wise elf's silver hair glistens in the moonlight, and her eyes are a deep forest green, wise and kind, but currently troubled.",
              "instructions": "Write dialogue for Wollandora as she explains the situation. She should say: \"Thalbern, we have a problem. I received word from a friend from Faelendar. Some Valkaran relics from the elves' vaults have gone missing. Items that should never leave these woods.\" She nods toward the river, where the current glides past the standing stones. \"I saw a river boat, Valkaran-made, heading downstream to Kordavos. You must go to the city and investigate - find these relics before they disappear forever.\" Wollandora should NOT offer any transportation, boats, or assistance beyond information. She only provides the mission details and urges Thalbern to act. If Thalbern asks for further information about the relics, the boat, or Kordavos, this will trigger a transition to 'the-missing-relics' for more details. Once he is ready to accept or decline the overall mission, other transitions apply (e.g., to 'preparing-for-the-city' or 'back-home').",
              "image": "images/settings/realm-of-myr/the-midnight-summons/meeting-at-the-stones.png",
              "skipInitialNpcTurns": true,
              "npc": [
                {
                  "id": "wollandora",
                  "behavior": "Concerned about the missing relics, focused on getting Thalbern to investigate in the city.",
                  "initialInitiative": 1
                }
              ],
              "transitions": [
                {
                  "condition": "If Thalbern accepts or the mission",
                  "encounter": "preparing-for-the-city"
                },
                {
                  "condition": "If Thalbern refuses the mission",
                  "encounter": "back-home"
                },
                {
                  "condition": "If Thalbern asks for more information",
                  "encounter": "the-missing-relics"
                }
              ]
            },
            {
              "id": "the-missing-relics",
              "title": "The Missing Relics",
              "intro": "",
              "instructions": "Wollandora can offer the following info:\n\nAs ancient Valkaran artifacts, deeply connected to the history and spirit of the Valkarr Forest, it is possible they could hold forgotten lore or possess secret untapped powers. The elves have kept them safe for centuries, to maintain the balance of the forest. She can allude to hearing about the rise of powerful figures in the human city who have little respect for the old ways or the forest. Somehow the elves have been drawn into the tangled politics and the relics have been stolen. \n\nWollandora remains focused on getting Thalbern to investigate in the city and **will NOT offer any transportation, boats, or assistance beyond this information**",
              "image": "images/settings/realm-of-myr/the-midnight-summons/meeting-at-the-stones.png",
              "skipInitialNpcTurns": true,
              "npc": [
                {
                  "id": "wollandora",
                  "behavior": "Focused on getting Thalbern to agree to investigate in the city. \"The hour is late and the trail grows cold. Will you take on this task?\"",
                  "initialInitiative": 1
                }
              ],
              "transitions": [
                {
                  "condition": "If Thalbern accepts or the mission",
                  "encounter": "preparing-for-the-city"
                },
                {
                  "condition": "If Thalbern refuses the mission",
                  "encounter": "back-home"
                }
              ]
            },
            {
              "id": "preparing-for-the-city",
              "title": "Preparing for the City",
              "intro": "The following morning, bathed in the soft light of the forest, Thalbern is back at his secluded home. Wollandora's words from the previous night echo in his mind – the stolen relics, the suspicious shipment, the urgent need to investigate in Kordavos.\n\nThe city's tangled ways are far from the quiet paths he knows. Thalbern carefully packs a change of simple, unassuming clothes, ensuring his hunting bow and a quiver of arrows were discreetly bundled, alongside a smaller hand axe and knife. As the sun climbed higher, he left the quiet security of his forest home, turning his steps towards the distant, bustling spires of Kordavos, a place where his survival instincts would be tested in a different kind of wilderness.",
              "instructions": "Thalbern should be fully healed from any wounds or fatigue from the previous night.",
              "image": "images/settings/realm-of-myr/the-midnight-summons/preparing-for-the-city.png",
              "notes": "This encounter serves as a narrative bridge and allows the player to make small, character-flavoring decisions before the next main section of the adventure.",
              "resetHealth": true
            },
            {
              "id": "back-home",
              "title": "Back home",
              "intro": "The following morning, bathed in the soft light of the forest, Thalbern is back at his secluded home. Wollandora's words from the previous night echo in his mind – the stolen relics, the suspicious shipment, the urgent need to investigate in Kordavos.\n\nHe had turned down her request for his help.\n\nHad he made the right choice? He did not enjoy the city, but Wollandora's claims of stolen relics were intriguing. Perhaps a trip to the city would prove tobe worth it.",
              "instructions": "",
              "image": "images/settings/realm-of-myr/the-midnight-summons/back-home.png",
              "notes": "This encounter serves as a narrative bridge and allows the player to make small, character-flavoring decisions before the next main section of the adventure.",
              "resetHealth": true
            }
          ]
        }
      ]
    }
  ],
  "npcs": {
    "wollandora": {
      "id": "wollandora",
      "type": "npc",
      "name": "Wollandora",
      "archetype": "Druid",
      "race": "Elf",
      "gender": "Female",
      "appearance": "A wise elf with silver hair braided with leaves and twigs. Her eyes are a deep forest green, wise and kind, but currently troubled. She carries a staff of gnarled oak.",
      "personality": "Wise, patient, deeply connected to nature, fiercely protective of the forest balance.",
      "background": "An ancient guardian of the Valkarr woods, a friend to Thalbern, and a powerful druid.",
      "motivation": "Recover the stolen relics and restore balance to the forest. Protect the secrets of her people.",
      "behavior": "Generally calm and thoughtful. Will provide information and guidance. Can be firm when necessary.",
      "image": "/images/settings/realm-of-myr/the-midnight-summons/npcs/wollandora.png",
      "healthPercent": 100,
      "attributes": {
        "strength": 10,
        "dexterity": 12,
        "constitution": 12,
        "intelligence": 16,
        "wisdom": 18,
        "charisma": 14
      },
      "status": ""
    },
    "owlbear": {
      "id": "owlbear",
      "type": "npc",
      "name": "Owlbear",
      "archetype": "Monster",
      "race": "Owlbear",
      "appearance": "A hulking monstrosity with the body of a bear and the head of an owl. Thick, matted fur, razor-sharp talons, and a powerful beak. Its eyes glow with a feral intensity.",
      "personality": "Territorial, aggressive, primal.",
      "motivation": "Defend its territory, hunt for food.",
      "behavior": "Attacks perceived threats on sight. Fights with ferocity. Can be driven off by overwhelming force or a display of superior power.",
      "image": "/images/settings/realm-of-myr/the-midnight-summons/npcs/owlbear-portrait.png",
      "healthPercent": 100,
      "attributes": {},
      "status": ""
    }
  }
}