{
  "name": "Realm of Myr",
  "description": "The setting of Myr is a rich and diverse fantasy world filled with vibrant cultures, ancient civilizations, and varied landscapes, from lush forests and towering mountains to vast deserts and mysterious seas.\n\nThe world is home to humans, elves, dwarves, halflings, orcs, and more, each with their own unique societies and histories. Nations within the main continent in Myr range from wilds and townscapes of the March of Davos, to the powerful and expansionist Asterian Empire, and on to the mysterious elven realms of Evervale and the hardy dwarven kingdoms of Hammerdeep. Myr’s history is marked by the rise and fall of great empires, legendary heroes, and the influence of powerful Immortals who guide and manipulate the mortal world.",
  "genre": "Fantasy",
  "image": "images/d20/1724187594398-fantasy_rpg_setting_landscape._golden_hour._medieva_8df6369a-8279-4459-8b74-21980d9801f6.png",
  "technology": "In Myr, technology remains largely medieval, with societies relying on traditional tools, weapons, and craftsmanship, while magic often serves as a substitute for advanced machinery and innovation. On rare occasions, certain regions and cultures may experiment with blending arcane and mechanical elements",
  "magic": "Magic in Myr is an integral force, woven into the fabric of the world and accessible through intense study, innate talent, or divine favor. Arcane magic involves the manipulation of magical energies through spells and rituals, while divine magic is granted by Immortals to clerics and paladins. Magic permeates daily life in many regions, with enchanted items, teleportation, and protective wards being common among the learned, though true mastery is rare and often concentrated in the hands of powerful individuals or ancient orders. Myr also features mysterious ancient magical sites and artifacts of great power, some of which predate even the most ancient civilizations, making magic both a source of awe and danger.",
  "locations": [
    {
      "name": "March of Davos",
      "description": "The March of Davos, a wild and rugged frontier nestled in the southern regions of the continent of Thylún in the realm of Myr. This setting blends high adventure with political intrigue and ancient mystery. Davos is a land rich with ancient ruins and forgotten magic, caught between the ancient traditions of its native Valkaran population and the recent allegiance to the Asterian Empire. \n\nThe recently instated Margrave Aeron Davos rules with autonomy, but the threat of conflict with surrounding regions, both internal and external, keeps tensions high. Adventurers find themselves drawn to this land of opportunity, where fame, fortune, and hidden knowledge await those brave enough to seek them.",
      "image": "images/d20/1724278021314-fantasy_rpg_setting_landscape._detailed_illustratio_8cd6206d-f488-4d12-87e7-9e2822b67ff7.png",
      "history": "In ancient times, when the forests of Valkara stretched vast and unbroken, the city of Verodyn was founded by the first Valkaran clans. This city soon blossomed into a thriving center of culture and power, its influence reaching far beyond the borders of the fertile land. Under the rule of wise and noble kings, the Valkaran Kingdom flourished, its cities adorned with grand temples and its warriors feared across the realm. The people lived in harmony with the land, guided by their deep respect for the spirits of nature and the wisdom of their ancestors.\n\nAs the centuries passed, far to the east, the Asterian Empire rose to prominence. This powerful empire expanded swiftly, its armies and ships dominating vast territories. Yet, despite the might of Asteris, the Valkaran lands remained independent, their dense forests and mountain strongholds protecting them from invasion. However, the Valkaran people soon found themselves beset by internal strife and raiders from the northern wilds. Their once-great kingdom began to fracture, and the proud city of Verodyn became a shadow of its former glory.\n\nIt was during this time of turmoil that Margrave Aeron Davos, a noble of the Asterian Empire, traded his ancestral lands for control over the Valkaran territories. He established the March of Davos, bringing with him Asterian nobility who settled in the region. The Asterian settlers often displaced the native Valkarans, leading to growing tensions between the two peoples. The March of Davos became a land of both opportunity and conflict, its forests and mountains hiding ancient secrets that called to adventurers from across Myr.\n\nAs the years passed, these tensions reached a boiling point. Uprisings broke out, with the Valkarans seeking to reclaim their ancestral lands from the Asterian invaders. To bridge the cultural divide between the Valkarans and the Asterians, the Sunfire Order was founded. This religious order sought to unite the two peoples under a shared faith, blending the ancient Valkaran reverence for nature with the structured beliefs of the Asterian Empire. Though peace was eventually restored, it was fragile, and the land remained divided in spirit.\n\nIn the present day, the March of Davos is a land of uneasy peace. Adventurers from all corners of Myr flock to the region, drawn by the lure of the wildlands and the promise of fortune hidden within the ruins of forgotten civilizations. The Margrave rules with a firm hand, striving to maintain order and loyalty to the Asterian Empire, even as old wounds between the Valkarans and Asterians continue to fester beneath the surface.",
      "inhabitants": "",
      "organizations": []
    },
    {
      "name": "Kordavos",
      "description": "Kordavos, the capital of the March of Davos, stands as a shining beacon of civilization on the edge of the wild and untamed lands of Valkara. Nestled on the coast of the Jade Sea, it is a bustling port city where cultures, goods, and ideas from across Myr converge. The city’s location makes it a critical hub for trade between the Asterian Empire and the frontier territories, and as such, it is a place of wealth and opportunity, but also of stark contrasts and underlying tensions.\n\nKordavos is a city of contrasts—where wealth and poverty, power and weakness, civilization and wilderness all collide. It stands as a gateway to the untamed lands of Valkara, a place where the ambitions of the Asterian Empire meet the stubborn independence of the Valkaran people. For those who live there, Kordavos offers both opportunity and danger, and for those passing through, it is a city where fortunes can be made or lost in the blink of an eye.",
      "image": "images/d20/1724280044861-Bustling_medieval_city_street_at_midnight._In_the_s_264e9e90-7e9a-4aba-b164-b02e72738087.png",
      "history": "",
      "inhabitants": "",
      "organizations": [
        {
          "name": "The Church of Valkara",
          "description": "The Church of Valkara stands as a pillar of tradition and spiritual guidance for the Valkaran people, intertwining their ancient heritage with the worship of their revered Immortals. Deeply rooted in the cultural fabric of Valkara, the Church promotes values of strength, wisdom, and connection to nature, all while preserving the history of the Valkaran people. At the heart of the faith are the three Immortals—Thalor, the mighty Warrior King, Thyra, the Wayfinder of the wilds, and Dmitriev, the Guardian of the Dead—each embodying the core ideals that Valkarans hold dear.\n\nThalor the Warrior King represents the strength, courage, and leadership of the Valkaran people. Once a legendary ruler who defended his land against invaders, Thalor ascended to Immortality through his heroic deeds, and his followers seek his guidance in times of conflict. He is honored by warriors, leaders, and anyone who fights to protect the people and traditions of Valkara. His shrines are adorned with symbols of battle and bravery, and offerings to him are made before any major conflict or journey. Thalor’s legacy endures as both a protector and unifier of the Valkaran way of life.\n\nThyra the Wayfinder, the druidic mistress of the natural world, is revered for her deep connection to the land and her wisdom in guiding people through both physical and spiritual paths. She embodies the untamed spirit of Valkara’s wild places, with her followers—rangers, druids, and wanderers—dedicating their lives to protecting the balance between nature and civilization. \n\nDmitriev, the solemn Guardian of the Dead, watches over the souls of the departed, ensuring they safely pass into the afterlife. His temples serve as places of mourning and reflection, and his priests tend to the graves of the ancestors, making sure they are honored in accordance with ancient rites. Together, these three Immortals guide Valkarans through life, death, and all the trials in between.",
          "image": "images/d20/1727303487203"
        }
      ]
    },
    {
      "name": "The Valkarr Forest",
      "description": "The Valkarr Forest is a vast, ancient woodland that stretches across the eastern borders of the March of Davos, shrouding the land in deep shadows and mystery. The trees here are tall and gnarled, their thick canopies blotting out much of the sunlight even at midday. Moss-covered trunks and twisted roots snake through the undergrowth, creating a labyrinthine maze where only the most skilled woodsmen dare to venture. \n\nDeep within the Valkarr, forgotten ruins of the old Valkaran kingdom lie hidden, their crumbling stones overgrown with ivy and their secrets guarded by the ancient spirits of the woods.\n\nThe Valkarr is a place of both beauty and danger, where the line between the natural and the supernatural is thin. It is home to many creatures, both mundane and magical—elusive elves who move silently through the trees, cunning goblins who make their lairs in the dark recesses of the forest, and wild beasts that prowl the shadows, ever watchful for unwary travelers. \n\nThe forest is also said to be touched by ancient magic, with certain groves and clearings rumored to be places of power where the veil between worlds is thin. Many who enter the Valkarr seek its secrets, but not all return, for the forest is as unforgiving as it is enchanting, and those who do not respect its ancient ways may find themselves lost forever in its depths.",
      "image": "images/d20/1725315286351",
      "history": "The Valkarr Forest is a remnant of an ancient era when the Valkaran kingdom stretched across much of the land. Once, this forest was a sacred place, revered by the Valkarans as the heart of their spiritual and cultural life. The druids of old tended to its groves, and the great kings of Valkara held their most important rituals beneath its towering oaks. As the Valkaran kingdom waned, the forest became a refuge for those who resisted the encroaching forces of the Asterian Empire. \n\nOver the centuries, the Valkarr grew wild and untamed, its sacred sites abandoned and forgotten by all but the most devoted. Today, the Valkarr is a place of deep mystery and untold danger, where the echoes of its storied past still linger in the shadows, shaping the forest into the enigmatic and foreboding wilderness it is known as today.",
      "inhabitants": "The Valkarr Forest is sparsely populated, with only a few scattered settlements daring to exist within its shadowed depths. The inhabitants are a mix of druids, rangers and Valkaran descendants who have remained true to the old ways, living in small, hidden villages.\n\nVarious humanoid tribes make their homes in the deeper, more dangerous parts of the forest, where they are rumored to guard ancient treasures and perform twisted rituals.\n\nThe forest is also home to a reclusive and enigmatic elven clan known as the Lindrathil. Dwelling deep within the heart of the forest, the Lindrathil have lived in harmony with the ancient woods for countless generations, their lives intertwined with the natural magic that permeates the land. \n\nThey are guardians of the Valkarr, fiercely protective of its secrets and its ancient groves. The Lindrathil rarely interact with outsiders, preferring to remain hidden, but those who manage to gain their trust speak of a people deeply connected to the spirit of the forest, practicing ancient rituals and magic that have been passed down through the ages. Their culture is one of reverence for the land, and they view themselves as the last line of defense against the encroachment of civilization and the dark forces that threaten the Valkarr.",
      "organizations": []
    },
    {
      "name": "Hammerdeep",
      "description": "Hammerdeep is a formidable dwarven kingdom nestled deep within the Ironclad Mountains, known for its extraordinary craftsmanship and the indomitable spirit of its people. The kingdom’s heart is the Great Forge, where master smiths create legendary weapons and intricate works of art from rare metals and precious gems. The city’s architecture is a marvel of dwarven engineering, with vast halls and tunnels illuminated by glowing crystal formations that light the subterranean realm.\n\nThe culture of Hammerdeep is centered on resilience, tradition, and craftsmanship. Dwarves here take great pride in their work, with every citizen contributing to the kingdom’s prosperity through skilled labor and dedication to their clan. Though they are wary of outsiders, the dwarves of Hammerdeep honor alliances with those who prove their worth, maintaining their stronghold as a beacon of strength and endurance in the heart of the mountains.",
      "image": "images/d20/1725324581077",
      "history": "Hammerdeep was founded by the first dwarven clans under the leadership of King Durgrim Hammerdeep, who sought refuge in the Ironclad Mountains during a time of great strife. Carved from the mountain's stone, Hammerdeep grew into a formidable kingdom renowned for its masterful craftsmanship and unassailable defenses. The Great Forge, the heart of the kingdom, fueled its prosperity, making Hammerdeep the finest source of weapons and metalwork in Myr. Despite countless threats, the dwarves have remained steadfast, fiercely protecting their ancestral home and its hidden treasures.",
      "inhabitants": "",
      "organizations": []
    },
    {
  "name": "Willowdale",
    "description": "The Willowdale Dell is a serene and idyllic place of gentle rolling hills, verdant meadows, and meandering streams. It is the ancestral home of the Smallfolk, a jovial and peace-loving people known for their love of good food, hearty ale, and simple pleasures. Their homes, often called 'burrows' or 'holts,' are built directly into the soft earth of the hillsides, with round, brightly painted doors and cozy, labyrinthine interiors. The Dell is primarily agricultural, with small farms and orchards dotting the landscape, and the air is often filled with the scent of fresh-baked bread and pipeweed. While generally peaceful and isolationist, the Smallfolk of Willowdale Dell possess a quiet strength and a fierce loyalty to their way of life, especially when threatened by outsiders. They are known for their hospitality, though they prefer to keep to themselves, valuing community and tradition above all else.",
    "image": "images/settings/realm-of-myr/images/willowdale.png",
    "history": "For centuries, the Smallfolk have lived in Willowdale Dell, a legacy stretching back to when their ancestors first carved homes into the soft hills. Originally a collection of independent family 'holts,' the various clans eventually united under the informal guidance of the Council of Elders, forming a loose confederation that valued self-sufficiency and communal support. Their history is largely one of peaceful cultivation, marked by bountiful harvests and joyous festivals. They have weathered minor skirmishes with forest creatures and occasional, curious outsiders, but their remote location and unassuming nature have largely protected them from major conflicts. While the March of Davos has expanded and empires have risen and fallen across Myr, the Smallfolk of Willowdale Dell have steadfastly maintained their quiet traditions, preferring to live simply and harmoniously with the land.",
    "inhabitants": "The primary inhabitants of Willowdale Dell are the Smallfolk, a small, hearty, and good-natured people. They are known for their curly hair, often bare feet, and a profound appreciation for life's simple comforts. Most Smallfolk are farmers, brewers, or artisans, with a strong emphasis on self-sufficiency and communal sharing. They tend to be wary of 'Bigfolk' (taller races) and their complex ways, preferring the company of their own kind. Beyond the Smallfolk, the Dell is home to various docile wildlife and the occasional reclusive individual of another race who has managed to gain their trust, often by demonstrating a similar love for peace and quiet. Small, family-owned inns and taverns serve as social hubs, where stories are shared, and local news is passed around over a pint of the finest 'Root Brew'.",
    "organizations": []
    }
  ],
  "isPublic": true
}