{"sections":[{"title":"Arrival At Kordavos","plot":"The adventurers arrive at the grand gates of Kordavos during the lively Valkaran Harvest Festival. Tension erupts between rival Valkaran clans. The new arrivals are drawn in to a heated confrontation between members of the Valtor and Blackthorn Clans. The dispute escalates rapidly, threatening to spill into a full-blown brawl and the adventurers have the opportunity to intervene.\n\nTheir actions draw the attention of various locals, each with their own agendas and desires. At the Dragonbone Inn, two representatives of the Blackthorn Clan and are presented with the opportunity to investigate a missing shipment at the docks, hinting at lucrative opportunities and favor with influential figures. \n\nThe next morning, as dawn paints the sky with hues of gold and rose, they encounter Elara, a young woman with weary eyes and an air of desperation. She pleads for their help in finding her missing brother, who vanished under mysterious circumstances while pursuing secrets that could alter the fate of Kordavos. ","scenes":[{"title":"Arrival at Kordavos","description":"The adventurers arrive at the grand gates of Kordavos during the lively Valkaran Harvest Festival. The atmosphere is festive, with stalls offering exotic goods, street performers entertaining the crowds, and the tantalizing aroma of local delicacies wafting through the air.","encounters":[{"name":"The Gates of Kordavos","narrative":"As the adventurers approach the grand gates of Kordavos, they are greeted by the sight of towering stone archways adorned with vibrant Asterian and Valkaran banners fluttering in the breeze. The sound of laughter, music, and lively chatter fills the air, signaling the ongoing festivities of the Harvest Festival just beyond the gates. \n\nHowever, before they can join the revelry, they find themselves in a long line of travelers, merchants, and villagers all waiting to be inspected by the city guard. A few guards move among the crowd, occasionally pulling aside individuals for further questioning.\n\n\"Next!\" shouts a burly Asterian guard with a stern face but kind eyes. Stepping forward, he inspects each person meticulously. \"State your business in Kordavos,\" he demands from each group. \"There is a fee of three marks for entrance.\"","notes":"This is an opportunity for each player to introduce their character to the story.","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725044729016","npcs":[{"name":"Garlan Ironfist","race":"Human","gender":"Male","characterClass":"Fighter","level":"3","appearance":"A burly man with a stern face, kind eyes, and a well-groomed beard. He wears the polished armor of the Kordavos city guard, with a blue-and-gold tabard showcasing the city's crest.","personality":"Diligent and fair, Garlan takes his duty seriously but can show kindness to those who need it.","abilities":"","characterId":"garlan-ironfist","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725143818361"}]},{"name":"The Harvest Festival","narrative":"Beyond the gates, are the sights, sounds, and smells of the annual Valkaran Harvest Festival. Stalls line the streets, showcasing crafts and goods from all over Thylún. Street performers are everywhere—jugglers, acrobats, and fire-eaters—each competing for the attention of the bustling crowds. The aroma of roasted meats, sweet pastries, and spiced wines is almost intoxicating, drawing people to the food stalls.\n\n\"Come, try your luck!\" a vendor shouts, gesturing to a game of chance where players can win small trinkets and toys. Another stall features a fortune teller, Madam Zephyra, who peers into a crystal ball, her face partially concealed by a veil. \"I see great things in your future,\" she whispers to a customer with a mysterious smile.\n\nIn the center of the square, a stage has been erected where musicians play lively Valkaran tunes, and dancers invite onlookers to join in the merriment. Children dart through the crowd, laughing and playing games. The atmosphere is infectious, making it hard for anyone to resist getting caught up in the celebration.","notes":"- This is an opportunity for the characters to potentially take notice of one another.\n- The adventurers can interact with various NPCs such as vendors, performers, and townsfolk, each offering unique opportunities or challenges.\n- Karim the Jewel Merchant is a well-to-do merchant who has fallen into favor with the wealthy Blackthorn family.\n- Madam Zephyra can provide cryptic hints or prophecies that may pertain to future events in the adventure.\n- Llora is a proud Valkaran. She will complain about the festival’s traditions being lost since the Asterians have come to power.\n- Merrick is related the son of Eamon, and is estranged from him, seeking to pursue artistic pursuits rather than power.","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725044853455","npcs":[{"name":"Karim the Jewel Merchant","race":"Human","gender":"Male","characterClass":"Trader","level":"1","appearance":"A middle-aged man with a neatly trimmed beard, wearing an embroidered tunic adorned with various gemstones.","personality":"Charismatic, shrewd, always looking for the next big deal.","abilities":"Expert in Jewels","characterId":"karim-the-jewel-merchant","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725141974945","specialAbilities":[{"name":"","description":""}]},{"name":"Madam Zephyra","race":"Elf","gender":"Female","characterClass":"Fortune Teller","level":"1","appearance":"Tall and slender, with piercing green eyes that seem to see through one's soul, dressed in flowing, colorful robes with mystical symbols.","personality":"Mysterious, wise, speaks in riddles.","abilities":"Divination","characterId":"madam-zephyra","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725142158675"},{"name":"Finnian the Fire-Eater","race":"Halfling","gender":"Male","characterClass":"Performer","level":2,"appearance":"A small, nimble figure with a mischievous grin, wearing a leather vest and a bandana to keep his hair back.","personality":"Energetic, daring, loves to entertain and show off his skills.","abilities":"Fire-eating, acrobatics, juggling.","characterId":"finnian-the-fire-eater","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725142650394"},{"name":"Liora the Spice Merchant","race":"Human","gender":"Female","characterClass":"Trader","level":4,"appearance":"Short and stout with a braided beard and hair, dressed in earthy tones with a belt full of small, exotic spice jars.","personality":"Warm, knowledgeable, always ready to share a story or a cooking tip.","abilities":"Expertise in rare spices and herbs, skilled storyteller.","characterId":"liora-the-spice-merchant","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725142385947"},{"name":"Merrick the Musician","race":"Half-Elf","gender":"Male","characterClass":"Bard","level":"1","appearance":"Lithe and graceful, with pointed ears and long, flowing hair, carrying a lute and wearing colorful, patchwork clothing.","personality":"Charming, soulful, enjoys bringing joy to others through music.","abilities":"Playing musical instruments, singing, enchanting performances.","characterId":"merrick-the-musician","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725142728914"}]},{"name":"Clan Conflict","narrative":"The festival is in full swing with music and dance. Most everyone is enjoying themselves, with the exception of two groups of people staring each other down on the outskirts of the celebration area. The atmosphere becomes tense as the crowd begins to sense the hostility, with murmurs spreading through the festival-goers.\n\n\"Your people have dishonored us for the last time!\" one leader shouts, his hand reaching for the hilt of his sword. The other leader, a tall woman with a scar across her cheek, snarls in response, \"And we won't tolerate your insults any longer!\"\n\nThe first leader, a burly man with a red-dyed beard, steps forward, his followers, all rough-looking men and women wearing mismatched armor, echoing his movements. \"We've been patient, but your arrogance knows no bounds, Larya,\" he growls, his eyes locked onto the scarred woman.\n\nLarya's group, consisting of more finely dressed individuals, some even wearing intricate jewelry, hold their ground. \"It's you and your thugs who bring chaos wherever you go, Barok,\" she retorts, her voice steady but filled with venom.\n\nThe air grows thick with tension as the onlookers inch away, creating an unintentional circle around the feuding parties. Street vendors glance around nervously while parents keep their children close, sensing the potential for violence. ","notes":"The Valtor Clan, led by Larya, views the Blackthorn Clan member Barok and his followers as disrespectful intruders threatening their traditional way of life. They are offended at the presence of Asterian symbols and parade participants during the traditional Valkaran even.\n\nMeanwhile, Barok and his group, who have embraced the Asterian way of life, aligning themselves with the Blackthorn clan, see the Valtor clan as archaic and obstructive. They have been accumulating power and wealth since the Asterians’ arrival and plan to continue to do so.\n\nUnless the players intervene, the situation will escalate into a full blown fight requiring the city guard to intervene.\n\nDepending on the actions of the adventurers, they may gain or lose favor with either or both factions, impacting future events in Kordavos.","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725127001688","npcs":[{"name":"Barok Redbeard","race":"Human","gender":"Male","characterClass":"Warrior","level":"3","appearance":"A burly man with a red-dyed beard, wearing mismatched armor that has seen many battles.","personality":"Hot-headed and prideful, with a strong sense of loyalty to his people.","abilities":"Sword fighting, intimidation, leadership","characterId":"barok-redbeard","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725127621254"},{"name":"Larya Halloway","race":"Human","gender":"Female","characterClass":"Rogue","level":"4","appearance":"A tall woman with a scar across her cheek, dressed in finely tailored clothes with hints of intricate jewelry.","personality":"Sharp-tongued and cunning, with a deep-seated need for respect and order.","abilities":"Stealth, diplomacy, dagger fighting","characterId":"larya-halloway","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725127643282"}]}]},{"title":"Evening Falls","description":"Suddenly, tension erupts between rival Valkaran clans that escalates into a brawl that turns the streets into chaos. The adventurers are forced to intervene, showcasing their combat prowess and rescuing innocent bystanders caught in the fray.","encounters":[{"name":"The Dragonbone Inn","narrative":"As the sun settles beyond the horizon, painting the sky in vivid hues of orange and purple, it becomes apparent that the time is approaching for securing lodging for the night. The closest tavern is The Dragonbone Inn, renowned for its eclectic mix of patrons and storied history. It promises a much-needed respite from the road.\n\nThe interior is warm and inviting, with the smell of roasting meat and the sound of a lively bard playing a jaunty tune on his lute. The tavern is filled with a diverse crowd—merchants, travelers, and a few suspicious-looking individuals huddled in dark corners. A large fireplace dominates one wall, its flickering flames casting dancing shadows across the room.\n\nThe innkeeper, a burly man named Bram, greets the adventurers with a hearty welcome and ushers them to a corner table where they can discuss their plans in relative privacy. As he sets down a tray of drinks, Bram remarks, \"Ah, the road can be a harsh mistress, can't she? You lot look like you've seen some excitement. This corner will give you a bit of peace to mull things over.\"","notes":"The players can secure lodging for the night and take this opportunity to discuss the aftermath of what happened at the festival. Encourage them to gather at the tavern. (see the next encounter)","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1725037898828","npcs":[{"name":"Bram","race":"Human","gender":"Male","characterClass":"Innkeeper","level":"1","appearance":"A burly man with a thick beard and jovial eyes, wearing a simple yet sturdy apron.","personality":"Hearty and welcoming, with a knack for making everyone feel at home.","abilities":"","characterId":"bram","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726055418469"}],"stages":[{"name":"New Companions","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726102302383","narrative":"The flickering light of the fireplace dances across the new companions sip their drinks. From various corners of the room, curious eyes glance their way—some merely passing, others lingering a little too long. There is a sense that, in a place like this, secrets and opportunities walk hand in hand, waiting for those bold enough to reach out and grasp them. ","notes":"The adventurers can interact with other patrons, picking up rumors and potentially learning more about the three family clans of Kordavos. Or they can just continue their conversation until the next set of encounters at the inn.","npcs":[],"stages":[]}]},{"name":"An Unsolicited Opportunity","narrative":"As late evening falls upon the Dragonbone Inn, a popular tavern in the heart of Kordavos, the air thickens with the scent of roasted meats and the sound of mugs clinking. The Valkaran Harvest Festival's exuberance still whispers through the rafters, and the atmosphere is filled with stories and laughter. Amidst the revelry, several locals eye the adventurers with curious intent.\n\nAmong them is Beric, a burly dockworker with a scar across his face, and Eamon, a scholarly type with an aura of intelligence. Beric speaks first, his voice gruff but respectful, \"Ye seem like quite an assorted lot. We could use some folks of varied talents like you lot.\"\n\nEamon, adjusting his spectacles, adds, \"Indeed, we have matters that require the expertise of seasoned adventurers. Intricacies that only your kind might handle.\"","notes":"\"It's best we discuss this privately,\" Eamon replies, his eyes darting towards the crowded room. \"Too many ears here.\"\n\nIf the adventurers agrees to a more secluded conversation, understanding the need for discretion. Beric and Eamon lead them to a quiet backroom at the rear of the inn, ready to hear their proposal.","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726093207477","npcs":[{"name":"Beric Sonacus","race":"Human","gender":"Male","characterClass":"Fighter","level":"3","appearance":"A burly man with broad shoulders, a rugged complexion, and a deep scar running diagonally across his face. His clothes are simple but sturdy, fitting for a dockworker.","personality":"Gruff but respectful, with a no-nonsense attitude. Loyal to his town and friends.","abilities":"","characterId":"beric","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726093177133"},{"name":"Eamon Drakovan","race":"Half-Elf","gender":"Male","characterClass":"Wizard","level":"4","appearance":"A slender and slightly frail looking elf with sharp facial features. His spectacles give him a scholarly look..","personality":"Intelligent and curious, with a calm demeanor. Often lost in thought or poring over ancient texts.","abilities":"Arcane knowledge, spellcasting, and a deep understanding of historical and magical lore.","characterId":"eamon","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726093191207"}],"stages":[{"name":"Backroom Dealings","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726098986831","narrative":"The backroom of the Dragonbone Inn was dimly lit, the flickering glow of a single candle casting long shadows across the rough wooden walls. The smell of roasted meat and spilled ale from the tavern beyond barely reached this quiet corner. A sturdy table occupied the center of the room, with mismatched chairs pulled haphazardly around it. \n\nBeric, a broad-shouldered dockworker with a scar running down his cheek, leaned against the table with his arms crossed, his expression as hardened as the calluses on his hands. Eamon, a thin, bespectacled half-elf in fine but travel-worn robes, sat next to him.\n\n\"We've got a bit of a situation,\" Beric began getting right to the point, his voice low but gruff, like the rumble of distant thunder. \"A shipment went missin' from the docks. Valuable cargo, meant for a noble up in the Asterian quarter. Never made it to where it was supposed to. Let's just say the people I work for ain't too pleased.\" He glanced at Eamon, who cleared his throat and leaned forward, his eyes narrowing as he spoke.\n\n\"The shipment is of great importance,\" Eamon added, his voice smooth and measured. \"It's more than just goods. Among the cargo were certain... artifacts. Items that could cause quite a stir if they fall into the wrong hands. We believe a group of smugglers operating out of the lower district may be responsible. However, our hands are tied—discretion is paramount, and we need individuals with your unique talents to recover it. Quietly.\" He pushed his glasses up the bridge of his nose, his gaze steady. \"There’s coin in it for you, of course.\"","notes":"The backroom of the Dragonbone Inn is a secluded area, dimly lit and isolated from the noise of the main tavern. Keep the atmosphere tense but not hostile. Beric and Eamon are wary but genuinely need help.\n\nThe conversation should feel like a business negotiation. Beric speaks bluntly, while Eamon is more refined and calculating.\n\nBorn and raised on the docks of Kordavos, Beric grew up in the rough-and-tumble world of sailors, traders, and smugglers. A dockworker by trade, he quickly learned that the line between legal business and underhanded dealings was thin. After a brief stint as a mercenary, Beric returned to the docks, using his strength and reputation to secure a steady job moving cargo and keeping order among the workers. He has been recruited by Eamon to serve as his bodyguard.\n\nBorn to an Valkaran mother and a traveling elven ranger of the Valkarr forest, Eamon has always straddled two worlds, an outsider never fully belonging. He has been alive long enough to watch his human family, now rebranded as Blackthorn, align themselves with the Asterians. Drawn to the study of magical relics and arcane lore, Eamon has helped his human family behind-the-scenes in their rise to power and influence.\n\nHe will not reveal his allegiences, preferring to let people to believe what they will.\n\n","npcs":[]},{"name":"Negotiation","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726101916586","narrative":"\"Look, I ain't got hard proof, but there's been whispers down at the docks,” stated the grizzled Valkaran dockworker. \"Smugglers, most like. They’re slippery, but they ain’t ghosts. Someone’s movin’ goods that shouldn’t be moved. Could be your kind of work.\"\n\n”Discretion is crucial here,” the elder half-elf explained. “We cannot afford to draw attention, especially not with what’s involved. The fewer questions asked, the better for everyone.”","notes":"Beric and Eamon are affiliated with the Raskov Clan. Sensing the involvement of other parties, they wish to enlist an outside group who can't be traced back to them to act as agents on their behalf.\n\nBeric: Rough around the edges, but direct. He knows the docks well and has heard rumors about smuggling activity but can't prove anything.\n\nEamon: More cautious and deliberate, he hints that the artifacts in the shipment have dangerous or magical properties but will not elaborate.","npcs":[],"stages":[]}]}]},{"title":"Plea for Help","description":"After quelling the street brawl, their actions draw the attention of various locals. Among them is Elara, a desperate woman who pleads for their help in finding her missing brother Joran, who disappeared under mysterious circumstances.","encounters":[{"name":"Morning at the Dragonbone","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726111833875","narrative":"As dawn breaks and pale light filters through the windows of the Dragonbone Inn, the smell of freshly baked bread and brewing coffee fills the air. The innkeeper, Bram, moves about, preparing for the day ahead.\n\nAs the new companions gather for a new day’s beginning, the door creaks open, and in steps a woman. She is visibly distraught, her face pale and tired, and her clothes slightly disheveled as if she hasn’t slept. Her eyes are red-rimmed, and there’s a nervous energy about her as she scans the room.\n\nBram immediately notices her and makes his way over with a look of concern. “Elara,” he says gently, “you’re early today. Everything alright?” His voice carries the warmth of familiarity, and it's clear they know each other well.\n\nElara gives him a faint smile, though it doesn’t reach her eyes. “I’m here to drop off those supply orders for the upper district,” she explains, pulling a small sheaf of parchment from her bag. “I promised I’d help out where I could, but…” Her voice falters, and it’s clear her mind is elsewhere.\n\nBram nods, taking the papers but not prying further. He knows the source of her distress. “Sit down for a bit, lass,” he says kindly, gesturing toward a table near the adventurers. “You’ve been running yourself ragged.”\n\nReluctantly, Elara sinks into the chair, letting out a sigh. “I’ve been trying to keep up with work… it helps keep my mind off Joran. But no matter where I go, there’s no sign of him.” Her voice trembles, and she rubs her forehead, clearly exhausted.\n\nBram exchanges a glance with the interesting group of new arrivals at his inn, before turning back to Elara. “You know, these folks here,” he says, nodding toward the group, “they seem like the kind who could handle a bit of trouble. Maybe they could help you.”\n\nElara looks up, unsure. “I don’t know… I don’t want to burden anyone,” she says softly, though her desperation is palpable.\n\nBram puts a reassuring hand on her shoulder. “It’s no burden, Elara. Joran’s been missing too long, and you know I’ve always looked after the both of you, ever since your father’s troubles. These folks might be able to help where others have failed. I’d trust them with this.”\n\nElara hesitates, then nods. “If you think they can help, Bram... I don’t know where else to turn.”\n\nBram offers her a comforting smile. “If anyone can, it’s them.”","notes":"Elara works part-time handling supply logistics for several businesses in the city, including local traders and inns, helping organize shipments and deliveries. She is caretaker for her mother, who has taken ill after the mysterious passing of her father.\n\nBram has known her for a long time and wants to get her the help she needs. He will be fairly insistent they aid her.\n\n“Listen,” he says, his voice taking on a more serious tone. “You’re not the usual crowd—seems to me you’ve got more in you than just passing through.”\n\nIf pressed, will even offer to let them stay for free if they as long as they help her.\n\n“Help Elara, and you can stay here at the Dragonbone, free of charge, for as long as it takes to find her brother.”","npcs":[{"name":"Elara Antonov","race":"Human","gender":"Female","characterClass":"Commoner","level":"1","appearance":"Young woman with pale skin, tired eyes that are red-rimmed, disheveled clothes, and an overall appearance of exhaustion.","personality":"Distraught, determined, and responsible. Has a deep sense of duty to her community and the people she cares about.","abilities":"Swift, knowledgeable about the town and surrounding areas, proficient in delivering messages and completing errands.","characterId":"elara","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726111995012"}],"stages":[{"name":"The Missing Brother","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726113544828","narrative":"Elara shifts uncomfortably in her seat. After a long pause, she exhales slowly, as if summoning the strength to explain.\n\n“My brother, Joran,” she begins, her voice barely above a whisper, “he’s always been one to chase after dangerous truths. After… after our father’s death, he became obsessed with uncovering why. He believed there was something more.” \n\nShe clasps her hands together, her knuckles white from the tension. “A few weeks ago, he came to me with... strange news. He’d uncovered information about an artifact. He said it could change everything for our people. But I didn’t understand. He wouldn’t tell me everything. He just said he was close to finding it.”\n\nElara’s voice catches, and she swallows hard before continuing. “Then, one night, he vanished. No note, no explanation. He just disappeared. I’ve searched everywhere, asked anyone who might have seen him, but no one knows where he’s gone.”\n\nShe looks down at the table, her voice filled with guilt. “The last time I spoke to him, I told him to stop chasing these dangerous ideas. That he was risking too much. Now I don’t even know if he’s alive.”","notes":"If the party agrees to help, Elara’s eyes fill with a glimmer of hope. “Thank you,” she whispers. “I don’t know how I can repay you, but… thank you.”\n\nBram nods approvingly, his voice soft but firm. “You’re doing the right thing, Elara. And you’re in good hands now.”\n\nElara offers a faint, grateful smile, though the worry in her eyes remains. “I just hope it’s not too late.”","npcs":[],"stages":[]},{"name":"Clues","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726176619441","narrative":"“The last place Joran mentioned going was the Silver Serpent, down by the docks,” she begins, her eyes darting between the adventurers. “It’s not the kind of place I’d ever want to go, but Joran... apparently he had dealings there of some kind.”\n\nShe hesitates, then sighs. “I tried going there myself, just after Joran vanished. But... the moment I stepped inside, they took one look at me and escorted me out. No one would talk to me, not a word. They know something. I could see it in their eyes.”\n\nHer hands move to a small leather scrollcase at her side. She grips it tightly for a moment, as if gathering the courage to continue. “There’s one more thing,” she adds, her voice dropping to a whisper. Slowly, she places the case on the table in front of the adventurers.\n\n“This belonged to Joran,” she says softly. “He spent a lot of time in the library, searching for answers about our father, Milos, and his research. These are his sketches and notes that he left behind. They’re written in some sort of code.”\n\nWith delicate fingers, Elara opens the case and carefully pulls out several sheets of parchment. The pages are filled with intricate sketches of symbols, maps, and notes in meticulous coded handwriting. \n\n“I haven’t been able to figure out what any of this means,” she admits, spreading the pages across the table.","notes":"If the characters roll successfully, they can determine that many of the symbols are ancient Valkaran runes, while others appear to be arcane in nature. If a magic user has a successful roll, they can infer that the symbology is related to spells of transmutaion and abjuration. Initially, they may be able to detect repeated references to a “key” that is apparently an old Valkaran relic of some importance. If the characters are especially perceptive or have elves amongst them, they can detect that some of the symbology is Elvish in origin.\n\nJoran and Elara’s father Milos was well-respected in Valkaran society, known for his scholarly contributions to preserving Valkaran culture. His work became dangerous when he uncovered information about ancient artifacts tied to Valkaran history. His studies drew the attention of powerful forces within the March of Davos which led to his life being abruptly ended under mysterious circumstances. The tragedy left their mother grief-stricken, and she fell seriously ill, now requiring constant care from Elara when she isn't busy trying to earn enough money to afford rent.\n\nJoran Antonov, a historian and political activist himself, had devoted his life to understanding and preserving Valkaran history. After his father’s untimely death, Joran was obsessed uncovering the truth. He learned that his father had discovered the whereabouts of a powerful ancient artifact from the long gone glory days of old Valkara.","npcs":[],"stages":[]}]}]}]},{"title":"The Investigation","plot":"As we begin part two, the party should have several avenues of investigation to pursue.\n\nJoran’s drawings and notes provided by his sister Elara reveal more about the ancient Valkaran secrets he and his father Milos had uncovered. When the adventurers visit the Grand Library of Kordavos connected to the Church of Valkara, their research reveals the younger and elder Antonovs were both after an artifact, some sort of key. \n\nOf course, the adventurers are all being watched by the three powerful clans. At an opportune time, the Covenant of the Cowl ambushes the characters in an attempt to steal Joran’s papers. The adventurers now have another mystery—who are the Covenant of the Cowl and what are they after?\n\nInvestigating the Silver Serpent Tavern will lead to finding out more about Joran’s contacts and the mysterious meeting he had before disappearing. The Silver Serpent is a dingy, shadowy establishment nestled among the dock warehouses. Sailors, smugglers, and other shady figures make up the clientele. When the adventurers inquire about Joran or the shipment, they are met with cold stares or subtle attempts to avoid the topic.\n\nIf the adventurers press further, either by offering coin, leveraging intimidation, or impressing a local patron, they’ll hear that Joran was seen meeting with a smuggler known as Silverhand in the lower district. He operates in an area known only as the Black Market.\n\nThe missing shipment is connected to smuggling operations in the Lower District and the docks. Dockworkers, wary of outsiders, are reluctant to talk. An old dockhand named Finn might eventually share that the shipment in question was being closely watched by figures linked to the Blackthorn Clan.\n\nThey can discover that the origin of the shipment was Faelendar, the main elven settlement nestled deep within the Valkarr forest. It was a highly unusual origin point for a shipment, but surprisingly there have been a number of shipments from there recently, all to be received by the Blackthorn family. In fact, there is quite a large shipment that just arrived today.\n\nWhen the adventurers go to inspect this shipment, they will find that it held a wild Forest Drake captured by the elves of the Valkarr. Suddenly, it escapes its cage and attacks the dockworkers. It was being delivered to be a special surprise at the Blackthorn’s upcoming Masquerade Ball.\n\nLady Astrid Blackthorn, a ranger and skilled beastmaster, emerges from the boat to attempt to help quell the beast. The Forest Drake was to be a centerpiece for the upcoming Blackthorn Masquerade Ball. She personally oversaw the care of the Drake during the journey, ensuring it was treated humanely.\n\nAfter the beast is dealt with, it will be discovered that someone had sabotaged the ship to orchestrate the Drake's escape and steal valuable elven goods from the shipment. Astrid assumes it is the work of the Raskov clan, with Silverhand being the prime suspect. In actuality though, the sabotage and theft have been orchestrated by the Covenant. \n\nIf asked about the missing shipment, Astrid will be evasive and not mention the Key of Ilmarin. The Blackthorn family is using their resources to track down the thieves. \n\nAs a reward for helping, Astrid will invite the party to the Masquerade Ball.","scenes":[{"title":"The Library","description":"The adventurers visit the Grand Library of Kordavos, a majestic structure connected to the Church of Valkara. They sift through ancient tomes and scrolls, uncovering the significance of the artifact known as the Key of Ilmarin. The library is filled with the scent of old books, and the air is tinged with an aura of mysticism. As they delve deeper, they feel eyes upon them, shadowy figures keeping tabs on their every move.","encounters":[{"name":"The Old Grand Library","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726275316858","narrative":"The Old Grand Library stands as a beacon of knowledge in the rugged frontier of the March of Davos. Connected to the nearby Church of Valkara, the library is an ancient building characterized by its grand structure: arched ceilings, intricate stained-glass windows depicting the deeds of Valkaran saints, and ivy-lined stone walls. \n\nInside, towering bookshelves filled with rare and mystical texts stretch up toward the lofty ceiling, while secluded reading alcoves offer quiet sanctuaries for study. Cobblestone floors echo with the footsteps of countless seekers of knowledge over the centuries, and a faint scent of old parchment and burning candles fills the air. \n\nA robed woman steps gracefully from the shadows of a nearby alcove, her presence calm yet commanding. Her long, dark hair is braided intricately, and the soft glow of candlelight reflects off the silver pendant she wears—a delicate symbol of a tree intertwined with the moon, marking her as a follower of Thyra. She approaches the adventurers with a serene smile, her eyes warm with understanding.\n\n\"Welcome to the Grand Library,\" she says softly, her voice carrying a soothing authority. \"I am Sister Danica, a cleric of Thyra, the Wayfinder. You appear as travelers in search of something beyond the ordinary. If there is knowledge you seek, I would be honored to assist you on your path.\"\n\nShe gestures toward a nearby table, inviting them to speak further. \"The library holds many secrets—some ancient, some untamed. Let us explore the answers together.\"","notes":"Sister Danica will assist the characters in their research but she is also watching them. She will be reporting their actions to her superiors.\n\nIf the party reveals the purpose of their investigation, Sister Danica will recommend they look in the private archives. Only one person is allowed at a time.\n\nIf asked about Joran, she will respond, “Joran Antonov? I have heard his name whispered among scholars and seekers alike. He was a passionate soul, always in search of the truth, especially about his father’s work. It is unfortunate he has gone missing. The library holds no recent records of him, but I do hope you find him safe.”","npcs":[{"name":"Sister Danica","race":"Human","gender":"Female","characterClass":"Cleric","level":"2","appearance":"A robed woman with long, dark hair braided intricately. Wears a silver pendant with a symbol of a tree intertwined with the moon, marking her as a follower of Thyra.","personality":"Calm, serene, commanding, understanding.","abilities":"Healing spells, knowledge of ancient texts, spiritual guidance, light manipulation.","characterId":"sister-danica","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726275370282"}],"stages":[{"name":"The Private Archives","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726280666856","narrative":"In the quiet corridors of the Grand Library, Sister Danica leads the adventurers down a winding staircase, away from the main hall and toward a smaller, hidden chamber. The air grows cooler and more still as they descend, the flickering torchlight casting elongated shadows on the stone walls. Finally, they reach a thick wooden door adorned with intricate carvings of leaves and stars—the symbol of Thyra woven into its design.\n\n\"This,\" Danica says, her voice dropping to a whisper, \"is the private archives. Only one individual may access this room at a time, a tradition maintained to safeguard the knowledge within. What you seek may be found here, but be prepared—the scrolls and tomes inside are not for the faint-hearted. They contain truths that can change the course of history.\"\n\nShe steps back, her hand resting on the iron handle. \"Who among you will enter? Choose carefully, for what you find here could shift the balance of power in ways unforeseen.\" The quiet hum of enchantments lingers in the air, a faint reminder that this room holds more than just ancient texts—it guards forgotten secrets that only the brave dare uncover.","notes":"","npcs":[],"stages":[]},{"name":"The Archivist","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726281576383","narrative":"The air inside within the private archive is cool and still, thick with the scent of parchment and leather-bound tomes that have endured for centuries. Dim light filters through narrow stained-glass windows, casting colored patterns onto the floor made of worn stone. Towering bookshelves line the walls, filled with scrolls, manuscripts, and relics of the past.\n\nIn the center of the room stands an ancient reading table, where a few scattered documents lay, seemingly awaiting inspection. Along one side, a locked glass cabinet holds rare texts and artifacts, some gleaming faintly in the half-light.\n\nFrom the shadows emerges an elderly man, the Archivist, his pale face framed by thin gray hair. He wears simple robes adorned with the symbol of Valkara, and a pair of spectacles hangs loosely around his neck. His keen eyes scan the adventurer, assessing their presence, before a small smile curls at his lips.\n\n\"Ah, welcome,\" he says, his voice low and steady, though there's an air of caution behind his tone. \"You must be one of those seeking the lost knowledge of Valkara.\" He steps closer, his hands clasped behind his back as he gestures to the shelves around them. \"There is much here that can enlighten, but some truths… well, some truths carry danger.\"\n\nHe leans in slightly, lowering his voice. \"Word has it you’re asking questions. Dangerous questions about the recent troubles in Kordavos.\" His eyes flicker knowingly. \"Be careful where you tread.\"\n\nThe archivist moves to the far corner, retrieving a set of scrolls and carefully placing them on the table. \"These records… well, they aren’t easy to come by. They speak of dealings of old—agreements made in secret.\" He pauses, casting a glance toward the locked cabinet. \"It would be wise to tread cautiously, friend. Many have vanished for much less.\"\n\nHe steps back, giving the adventurer a moment to absorb his words, leaving behind an aura of mystery and suspicion. \"Should you need guidance, I am here. But remember—some knowledge is best left undisturbed.\"","notes":"The archived documents provided are historical records of a Drakovan family that operated as a prominent noble house holding significant influence over local trade and military affairs, often using alliances and shrewd diplomacy to expand their power. The records suggest a history of betrayals and manipulation, where the Drakovans undermined rival Valkaran houses to grow their influence at all cost.\n\nThe last of the records reveal that the Drakovan family rebranded itself as the House Blackthorn just in advance of Asterian involvement in the region.\n\nIf asked about Joran, the archivist will be evasive. “Joran… yes, he was here. His research into the old Valkaran ways brought him too close to things better left buried. His obsession with his father’s work led him down a dangerous path. If I may offer some advice, tread carefully if you wish to follow where he has gone.”","npcs":[{"name":"Eldrin Varokich","race":"Human","gender":"Male","characterClass":"Archivist","level":"8","appearance":"An elderly man with a pale face, thin gray hair, and simple robes adorned with the symbol of Valkara. Spectacles hang loosely around his neck.","personality":"Cautious, wise, and enigmatic. He speaks with a low and steady voice, often hinting at secrets and dangers.","abilities":"Expert knowledge in ancient texts, secret lore, and dangerous truths.","characterId":"eldrin-varith","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726285595566"}],"stages":[]}]}]},{"title":"The Silver Serpent Tavern","description":"The adventurers make their way to the Silver Serpent Tavern, a dimly lit, grimy establishment frequented by sailors, smugglers, and other shady figures. The atmosphere is tense, filled with the smell of salty air and unwashed bodies. They approach the grizzled bartender, Harron, seeking information about Joran. Initially met with cold stares and resistance, they must leverage their skills to extract valuable information about Joran’s last known contacts.","encounters":[{"name":"The Silver Serpent Tavern","narrative":"The adventurers step into the dimly lit Silver Serpent Tavern, the air thick with the smell of salty seawater and unwashed bodies. The floor is sticky underfoot and the murmur of hushed conversations is occasionally punctuated by drunken laughter or the clinking of glasses. The tavern is filled with sailors, smugglers and other assorted nefarious individuals. A large map of the sea is carved into one wall, and an impressive collection of nautical memorabilia lines the shelves behind the bar.","notes":"Regardless of who the adventurers talk to, everyone in the establishment will be reluctant to talk","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726289298448","npcs":[],"stages":[{"name":"The Bartender","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726291468584","narrative":"Behind the bar, a grizzled man with deep-set eyes and a scar running down his cheek methodically wipes down glasses. His gaze is sharp, missing nothing despite his slow, deliberate movements. He looks up as the adventurers approach, his expression unreadable but not unfriendly.\n\n\"What’ll it be?\" he asks, his voice rough like gravel. It’s clear from his demeanor that he’s no stranger to those seeking more than just a drink at the Silver Serpent.","notes":"The bartender is a grizzled man named Harron, might provide minimal information at first—something vague about how “people who ask too many questions here tend to disappear.” If the adventurers press further, either by offering coin or leveraging intimidation/persuasion, they’ll hear that Joran was seen meeting with a smuggler known as Silverhand in the lower district. He operates in an area known only as the Black Market.\n\n“Now ye best move along. There be eyes and everywhere.,” he warns ominously.\n","npcs":[],"stages":[]},{"name":"The Dockworkers","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726292403106","narrative":"The Silver Serpent’s dimly lit common room hums with quiet conversation as a few groups of dockworkers sit hunched over mugs of ale at wooden tables. Their rough, weather-beaten faces and calloused hands speak of hard labor on the docks, and their eyes are sharp, ever watchful of their surroundings. As the adventurers approach, a few heads turn, and the quiet chatter softens to murmurs.\n\nOne of the men, a burly figure with a patchy beard and arms thick with muscle, leans back in his chair and takes a long swig of his drink before locking eyes with the newcomers. He exchanges a glance with his companions, who continue to drink in silence, their expressions guarded.\n\n“What’s your business here, strangers?” he finally asks, his voice gruff and tinged with suspicion. His tone makes it clear that outsiders don’t usually mingle with the regulars here, and any intrusion will need to be handled carefully.","notes":"If the adventurers press further, either by offering coin or leveraging intimidation/persuasion, they’ll hear about Silverhand, a prominent operator in the lower district, in an area known only as the Black Market.\n\n“If ye have any sense, ye best be moving along now. There be eyes and everywhere.,” he warns ominously.","npcs":[],"stages":[]}]}]},{"title":"The Docks","description":"The adventurers arrive at the bustling docks, finding it difficult to gain information from the wary dockworkers. Persistence pays off as an old dockhand named Finn reveals that the shipment in question originated from Faelendar and was being closely observed by figures linked to the Blackthorn Clan. This unexpected lead sends the adventurers further into the web of intrigue involving powerful families and ancient secrets.","encounters":[{"name":"Arrival at the Docks","narrative":"The sun casts a golden hue over the bustling docks of Kordavos as the adventurers arrive. The air is filled with the tang of saltwater, mingled with the earthy scent of freshly unloaded cargo. Towering ships bob gently in their berths, and from every corner, dockworkers laden with crates and barrels shout directions to one another, their voices lost in the cacophony of seagulls and the crashing of waves against the piers.\n\nAhead, a group of dockworkers pause their work, their sweat-streaked faces turning toward the adventurers with curiosity. One man, a grizzled veteran of the docks with a sun-worn face, sets down a crate and wipes his brow, eyeing the newcomers cautiously. ","notes":"Dockworkers, wary of outsiders, are reluctant to talk. An old dockhand named Finn might eventually share that the shipment in question was being closely watched by figures linked to the Blackthorn Clan.\n\nThey can discover that the origin of the shipment was Faelendar, the main elven settlement nestled deep within the Valkarr forest. It was a highly unusual origin point for a shipment, but surprisingly there have been a number of shipments from there recently, all to be received by the Blackthorn family. In fact, there is quite a large shipment that just arrived today.","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726345480155","npcs":[{"name":"Finn Radonik","race":"Human","gender":"Male","characterClass":"Fighter","level":"1","appearance":"Old and weathered dockhand","personality":"Gruff but fair. He’s a hard worker and expects the same from others. Deeply loyal to his friends.","abilities":"","characterId":"loric-windrider","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726344098147"},{"name":"Tor Marros","characterId":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726344982001","race":"Human","characterClass":"Fighter","gender":"Male","appearance":"A towering figure in his early forties, Tor is bald and heavily muscled, standing well over six feet tall. His arms are covered in crude tattoos of animals and mythical creatures, and he wears a sleeveless tunic to show them off. His thick neck and powerful build give him the nickname \"The Bull.\" He has a deep, gravelly voice that rumbles when he speaks.","level":"2","abilities":"Very strong","class":"Despite his intimidating appearance, Tor is calm and methodical in his work. He’s known for settling disputes at the docks with his sheer presence, preferring to use his strength only when absolutely necessary."},{"name":"Petra Velan","characterId":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726344936638","appearance":"A woman in her mid-forties with short, steel-gray hair tied back in a ponytail. Petra walks with a noticeable limp, the result of a ship’s accident years ago, and wears a metal brace on her right leg. She dresses practically in heavy work boots, a leather apron, and a patched shirt, often seen puffing on a pipe. Her tanned skin and muscular build speak to years of hard work.","race":"Human","characterClass":"Commoner","gender":"Female","level":"1","class":"Tough but fair, Petra is respected as a leader among the dockworkers. She’s efficient and direct, with little patience for nonsense, and is known for her quick decisions and no-nonsense attitude."}]},{"name":"Mystery Cargo","narrative":"Following Finn’s revelations, the adventurers decide to investigate the area where the shipment was last seen. The docks are a labyrinth of warehouses, narrow alleyways, and hidden corners. As they make their way to an inconspicuous storage shed tucked away behind larger warehouses, they notice furtive movements in the shadows.\n\nA group of suspicious figures lurks near the entrance, attempting to blend in with the workers but clearly out of place. One of them, a tall figure with a scarred face, spots the adventurers and signals to his companions. Realizing they’ve been made, the adventurers prepare for a confrontation.\n\n\"Who’re you lot?\" the scarred figure demands, stepping forward, hand resting on the hilt of a knife. \"Ain’t nothing here for the likes of you. Best be on your way.\"","notes":"The scarred figure is a minion of the Blackthorn Clan and sent to oversee the shipment, unaware of the adventurer's involvement until now. The map is crucial for directing the next steps in the investigation. DMs should use the warehouse skirmish to emphasize the immediate physical danger while the map revelation steers the plot toward uncovering the Blackthorns’ operations.","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726351294262","npcs":[{"name":"Alaric Fleyven","race":"Human","gender":"Male","characterClass":"Rogue","level":"2","appearance":"Tall and lean with a deeply scarred face, jet-black hair tied back in a ponytail, and piercing blue eyes.","personality":"Cautious and untrusting, fiercely protective of his crew and territory, has a sharp tongue and quick wit.","abilities":"Expert in stealth, pickpocketing, and knife fighting.","characterId":"scarface-alaric","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726346336662"}]},{"name":"The Beast Escapes","narrative":"A sudden, loud crash echoes from a nearby ship docked in the harbor. The ship rocks violently, and startled cries fill the air as dockworkers scramble to secure the ship’s lines. A deep, guttural roar reverberates from the cargo hold, followed by the creaking of wood under pressure.\n\nThe thick wooden doors of the hold explode outward, splintering as a massive creature emerges—a Forest Drake. Its scales shimmer in shades of green and brown, blending with the earthy tones of the ship’s hold. Its glowing yellow eyes dart wildly, wings stretching wide as it lets out a deafening roar. Panic sweeps the docks as workers scatter, some diving for cover while others shout warnings to those unaware of the danger.\n\nAt the edge of the gangplank, a woman stands with fierce determination. She’s tall, clad in rugged leather armor, her sharp features framed by windblown hair streaked with the earthy tones of the wild. A bow is slung across her back, and her hand rests on the hilt of a curved blade at her side. Her piercing gaze sweeps the chaos before her as she rushes forward, commanding the crew with authority. “Keep it contained! Don’t let it reach the harbor!” she shouts, her voice sharp and clear amidst the rising panic.","notes":"Finn’s additional information provides critical context for the next phase of the investigation. The Key of Ilmarin is a pivotal reveal, escalating the urgency and stakes of the quest. DMs should highlight Finn’s cautious yet helpful nature, ensuring he becomes a trusted contact while underscoring the omnipresent threat of Blackthorn surveillance.","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726354341751","npcs":[{"name":"Astrid Blackthorn","characterId":"","image":"/images/app/avatar/npc.png?v=1","race":"Human","characterClass":"Ranger","gender":"Female","level":"6","appearance":"Tall, clad in rugged leather armor, sharp features, wild windblown black hair. Intense eyes."}]},{"name":"The Aftermath","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726360716968","narrative":"As the dust settles and the echoes of the battle fade, the docks are left in disarray. Crates and barrels lay shattered across the ground, and a few torn sails flap lazily in the breeze. The scent of saltwater and crushed wood mingles in the air. Dockworkers slowly emerge from their hiding spots, cautiously surveying the damage.\n\nOne of the dockworkers approaches, his face pale and shaken. \"Never seen anything like it,\" he mutters, his voice trembling. \"Could’ve been a lot worse if it weren't for you lot.\"\n\nHer posture now regained with poise and confidence, the impressive woman ranger approaches the adventurers. Her forest-green eyes flicker with a mixture of gratitude and calculation. She wipes the grime from her face, tucking a loose strand of hair behind her ear.\n\n“Indeed,” she says echoing the dockworker, “I am Lady Astrid Blackthorn and it seems I am in your debt. Well met.”\n\nBefore anything else can can be said, a tall, broad-shouldered woman with short-cropped hair and a face hardened by years at sea whistles from the ship, standing next to the shattered cage that had once held the Forest Drake.\n\n“Sabotage!” she calls out, kneeling down to inspect the remnants of the cage. She motions for Astrid and the adventurers to join her. \n\n“Look here,” she says, pointing to the mangled steel bars. “These hinges weren’t forced from the inside—someone tampered with them. The lock mechanism’s been melted. Someone used acid, enough to eat through the steel, but slow enough not to raise suspicion until it was too late.”\n\nShe stands, brushing her hands off on her armor, her expression grim. “They knew exactly what they were doing. Whoever it was, they waited for the perfect moment—right when we docked—to unleash the drake. It wasn’t an accident.”\n\nAstrid’s eyes narrow, her lips pressed into a tight line. The implications hang heavy in the air, and it’s clear that this was no simple mistake.\n","notes":"If the players have not already received the clue to look into Silverhand at the Black Market, they should get it now.","npcs":[]},{"name":"An Invitation","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726361535587","narrative":"Astrid’s forest-green eyes flicker with a mixture of gratitude and calculation. She wipes the grime from her face, tucking a loose strand of hair behind her ear. \n\n\"You’ve done us a great service today,\" she says, her voice steady but carrying the weight of sincerity. \"Few could have handled a Forest Drake on the loose with such skill.\" She looks over the adventurers with clear respect in her gaze. \"You’ve proven yourselves more capable than most.\"\n\nShe pauses, glancing toward the scattered dockworkers, then back to the adventurers. \"The Blackthorn family doesn’t forget those who help us.\" She reaches into her belt pouch and pulls out a small, intricately designed invitation sealed with black wax bearing the Blackthorn crest. \n\n\"I’d like to extend a formal invitation to our Masquerade Ball. It’s an event for the elite of Kordavos, but after what you’ve done, it’s only right you be among us. The ball is this very week, held at our family estate. You’ll have a chance to meet important people—ones who can make a difference.\"\n\nAstrid hands the invitation to the nearest adventurer, her tone shifting slightly, more serious now. \"Come as our honored guests, but also know this: I may need people like you again. And those who stand with the Blackthorns often find themselves in powerful positions.\" She gives a nod of respect before stepping back, her eyes lingering on the adventurers for a moment longer before she turns to oversee the aftermath.","notes":"","npcs":[]}]}]},{"title":"The Black Market","scenes":[{"title":"The Lower Districts","description":"The adventurers step into the Lower District's tangled streets, noting the sharp contrast from the orderly North End. Cramped alleyways and dimly lit paths create an air of suspense as they navigate through the labyrinthine environment. Every corner and hidden nook seem to whisper stories of long-forgotten secrets and illicit dealings. The air is thick with the scent of spices and an undercurrent of danger.","encounters":[{"name":"Welcome to the Lower Districts","narrative":"The streets of Kordavos shift dramatically in the transition from the bustling energy of the docks into the shadowy, labyrinthine alleys of the Lower District. The atmosphere grows heavier, the air tinged with a faint staleness as if the sun rarely finds its way between the narrow, leaning buildings. The sounds of laughter and commerce that filled the upper city fade, replaced by the occasional clatter of distant footsteps, the low hum of whispered conversations, and the creak of doors that are quickly closed as passersby hurry through the dim-lit streets.\n\nThe Lower District is a different world—where the wealthy rarely tread and where secrets are traded like coin. Dilapidated tenements loom on either side, their windows dark and lifeless, while crooked alleyways twist in every direction like a maze designed to disorient even the most seasoned traveler. The streets are uneven, slick with refuse, and the occasional flicker of torchlight from distant corners does little to pierce the gloom.","notes":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726428910497","npcs":[]},{"name":"Beset by Street Urchins","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726439333709","narrative":"The winding streets of the Lower District are teeming with life, a chaotic mix of hurried vendors, wandering townsfolk, and shady figures lurking in the shadows. The air is thick with the scent of smoke from nearby chimneys, and the distant clatter of market stalls blends with the constant hum of conversation. \n\nPeople jostle past one another, their faces hidden beneath hoods or wide-brimmed hats, their steps quick as they navigate the crowded, narrow alleys. Children dart between adults, chasing each other or carrying small parcels, while street performers play haunting melodies on worn instruments.\n\nIn the midst of it all, a group of halfling urchins moves unnoticed, weaving through the crowd with practiced ease. A small, wide-eyed halfling with messy brown hair rushes through, laughing mischievously as he slips between legs. A red-haired halfling with dirt-smudged cheeks skips and bounces as she bumps into people along the narrow street. More halflings trail behind, exchanging jokes and giggling, blending seamlessly into the bustling flow of the district.","notes":"If the characters pass a perception test, they can discern that the halflings are up to something. \n\nRoll for success for the red-headed halfling to pickpocket the scroll case from whoever is carrying it. If they don't have the scroll case with them, then they will target a different valuable item or whoever appears the most wealthy in the group.\n\nIf chased, the halflings will dash into a narrow alley, their laughter echoing off the walls. Crates and barrels are knocked over in their wake as they try to slow down their pursuers. The halflings split up, vanishing into different side streets.\n\nIf they are successful in getting away with the scroll case, it will find its way to Silverhand who will use it as a bargaining chip with the Covenant.","npcs":[{"name":"Finn Swiftfoot","race":"Halfling","gender":"Male","characterClass":"Rogue","level":2,"appearance":"Small, wide-eyed, with messy brown hair and a mischievous grin","personality":"Cheerful and cunning, always looking for a quick escape or opportunity","abilities":"Expert in pickpocketing, stealth, and evasion","characterId":"finn-swiftfoot","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726439716482"},{"name":"Mara Redleaf","race":"Halfling","gender":"Female","characterClass":"Bard","level":2,"appearance":"Red-haired with dirt-smudged cheeks and a constant skip in her step","personality":"Playful and charismatic, known for her infectious laughter and musical talent","abilities":"Skilled in playing instruments, performing, and charming individuals with her songs","characterId":"mara-redleaf","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726439437517"}]},{"name":"Finding the Black Market","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726450092972","narrative":"Deeper into the Lower District, the streets seem to tighten and close in even tighter. The rickety buildings seem to lean overhead, casting long shadows in the fading light. The smell of damp stone and stagnant water fills the air. The sounds of the bustling city fade away, replaced by hushed conversations, the shuffle of cloaks, and the occasional glance from shadowy figures.","notes":"Roll for perception, one of the adventurers might notice something unusual—small, subtle symbols carved into the stone walls and wooden beams. A snake intertwined with a crescent moon. A crooked dagger etched faintly above a doorway. These are no mere graffiti; they are markers, covert signs left to guide those who know where to look. The catch? These symbols change daily, keeping the Black Market hidden from unwanted eyes.\n\nAlternatively, they may decide to approach one of the locals—a suspicious merchant or a lurking bystander—hoping to glean information. With a well-placed word or a bit of coin, they could persuade or charm someone into revealing the day’s clues. But the people here are wary, and only those who know how to play the game of the Lower District will get what they seek.","npcs":[]}]},{"title":"The Black Market","description":"Realizing that gaining access to the Black Market requires more than just finding it, the adventurers must employ their wit and resourcefulness to secure an invitation. This might involve persuading a local informant, bartering with a shady character, or even staging a risky infiltration. The stakes are high as they edge closer to the heart of the Lower District's underworld.","encounters":[{"name":"The Entrance to the Black Market","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726436939251","narrative":"Nestled between two crumbling buildings, is a makeshift entrance hastily constructed from old wooden boards. The entrance itself is nondescript—just a few planks nailed together with no visible markings. But to those who know what to look for, it’s unmistakable: this is the hidden doorway to the Black Market. A heavy cloth curtain hangs over the entrance, swaying gently in the faint breeze, concealing what lies beyond.\n\nStanding guard is a burly figure dressed in a tattered cloak, his face mostly hidden beneath a hood. His arms are crossed, and a long dagger is tucked visibly into his belt. As the adventurers approach, the guard eyes them with suspicion, his gaze sharp beneath the shadow of his hood.\n\n\"Looking for something?\" he grunts, his voice low and gravelly, stepping forward to block the entrance with his broad frame, waiting to see if the adventurers are worthy of entry.","notes":"\"No one gets in without the passphrase.\" \n\nThe adventurers have several strategies at their disposal to gain access to the Black Market. They might rely on diplomacy or charm, using Charisma-based skills like Persuasion or Deception to sweet-talk or bluff their way past the guard. If they've overheard or gathered the passphrase through investigation or by asking the right people, they could simply recall it and gain entry. Alternatively, bribery is a practical option, with a well-timed offer of gold convincing the guard to look the other way. If the group prefers more aggressive tactics, they could use intimidation or threats to force the guard to let them through, showing their combat prowess or making veiled threats.\n\nFor a stealthier approach, they could attempt to sneak past using Dexterity (Stealth) or employ magic like Invisibility to bypass the guard unnoticed. If they find themselves without the necessary information, they might return to the streets to gather intelligence from the locals, using persuasion or intimidation to learn the passphrase or gain insights into how to bypass the guard. Magic spells like Charm Person, Suggestion, or even Disguise Self can also help manipulate the situation, giving the adventurers a creative edge in gaining access to the Black Market.\n\nIf they simply attack, the guard will call for reinforcements, a group of six henchmen. If any of the characters are downed, they will awake to find themselves in a cell, captured and to be interrogated by Silverhand himself.","npcs":[{"name":"Garrick","race":"Half-Orc","gender":"Male","characterClass":"Fighter","level":4,"appearance":"Burly figure dressed in a tattered cloak, face mostly hidden beneath a hood. Long dagger tucked into his belt.","personality":"Suspicious and intimidating, but loyal to those he deems worthy.","abilities":"Expert in hand-to-hand combat, intimidation, and dagger usage.","characterId":"garrick","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726436888924"}]},{"name":"Labyrinthine Stalls","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726435567019","narrative":"The narrow, makeshift entrance opens into the strange, shadowy world of the Black Market, a labyrinthine maze of stalls and tents. Vendors whisper from behind their counters, their goods ranging from the mundane to the forbidden: rare potions, stolen artifacts, strange magical trinkets, and enchanted weapons. Strange characters lurk in the shadows, their faces hidden by cloaks and masks, conducting quiet deals or watching intently as the adventurers move through the market. The sounds of hushed bartering, the occasional sharp laugh, and the constant shuffle of feet fill the air. \n\nFrom the first stall, a scarred and grizzled vendor with a wild look in his eyes and a crooked smile leans forward. \"Looking for something special, are we? I've got charms to ward off death... for the right price.\"\n\nNearby, a dwarven vendor in a tattered cloak boasts as she holds forth an intricately carved dagger. \"You won’t find craftsmanship like this above ground, love.\"\n\nA young woman with a scar across her chin, chuckles quietly as she walks past. \"New faces,\" she remarks with a smirk. \"Fresh meat.\"\n\nFrom deeper within the maze of stalls, a cackling laugh echoes out. \"Step right up, step right up! Rarities from the far reaches of Myr! Trinkets to tempt fate, and scrolls that speak of forgotten powers!\" A small hunched figure waves a bony hand toward the adventurers, beckoning them closer. \"Come closer, strangers... I’ve got exactly what you need.\"","notes":"If the adventurers succeed on a perception check, their keen eyes catch sight of a stall tucked away in a shadowy corner, its vendor sitting casually behind a cluttered table. Among the trinkets and oddities, something familiar stands out: finely crafted elven goods, unmistakable in their delicate design and intricate craftsmanship. \n\nSilver goblets engraved with ancient elven runes, ornate wooden carvings from the Valkarr forest, and shimmering silks that glow faintly with an ethereal light are haphazardly displayed. These are the very items described in the missing shipment. The vendor, an oily man with beady eyes, watches passersby carefully, his fingers twitching nervously as he notices the adventurers’ interest.\n\n\"Ah, you've got a good eye,\" he croons, his voice slick with feigned charm. \"These pieces? Rare as they come. Found their way to me from... let’s just say, exclusive sources.\" He grins, but there’s something sinister behind the smile, and the adventurers now know they’re closer to unraveling the mystery of the stolen shipment.\n\nIf the characters are successful in pressing for more information, he will boast that the goods came to him by way of the infamous Silverhand himself.\n\nAs the adventurers mingle through the maze of stalls, it becomes clear that one topic dominates the hushed conversations around them: the upcoming auction. Whether they question the vendor selling the stolen elven goods or strike up a casual conversation with another merchant, the response is the same—the big auction is starting soon, where rare and powerful items will be up for bid.\n\nA grizzled merchant dealing in enchanted trinkets leans in close when they ask about it. \"You're not from around here, are you?\" he says with a knowing smirk. \"Big auction's coming soon. Finest goods, magical relics, maybe even some things no one should have their hands on. If you’ve got the coin, it's the place to be.\"","npcs":[{"name":"Grendar","race":"Human","gender":"Male","characterClass":"Merchant","level":"1","appearance":"A scarred and grizzled vendor with a wild look in his eyes and a crooked smile","personality":"Cunning, opportunistic, and always looking for a profitable exchange.","abilities":"Expert in appraisal and haggling, skilled in setting up traps and detecting lies.","characterId":"grendel-one-eye","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726436104061"},{"name":"Rae the Scarred","race":"Human","gender":"Female","characterClass":"Fighter","level":"1","appearance":"A young woman with a distinct scar across her chin. She has short, messy hair and wears rugged adventurer's gear.","personality":"Confident, bold, and slightly taunting.","abilities":"","characterId":"rae-the-scarred","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726439232056"},{"name":"Mizrith the Cackler","race":"Gnome","gender":"Male","characterClass":"Sorcerer","level":"2","appearance":"A hunched figure with a bony hand, bushy eyebrows, and an oddly large grin. His garb is a mix of colorful rags.","personality":"Eccentric, mischievous, and always eager to display his peculiar wares.","abilities":"Specialized in illusion and enchantment magic, adept at creating magical trinkets and rare scrolls.","characterId":"mizrith-the-cackler","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726438466481"},{"name":"Vera Azimov","characterId":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726438484598","race":"Dwarf","characterClass":"Weapon Dealer","gender":"Female","appearance":"Wears a tattered cloak","class":"Loud and boastful","level":"1"}]}]},{"title":"The Auction","description":"A rare artifact, believed to be connected to Valkaran heritage, is up for auction. The adventurers initially suspect it to be the key they seek. However, it turns out to be an old map, its significance shrouded in mystery. As they ponder the implications, they notice Silverhand, a prominent figure in the city’s smuggling operations, is also keenly interested in the item.","encounters":[{"name":"The Auction Begins","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726455716232","narrative":"The party is ushered into a shadowy, candlelit chamber deeper within the Black Market. The room is a stark contrast to the bustling stalls outside—quiet, dark, and secretive. Rows of velvet-covered seats are arranged before a small raised platform where the items will soon be displayed. The audience consists of a mix of shady figures, wealthy nobles, and collectors, their faces hidden behind intricately designed masks.\n\nA tall, slim figure draped in a black robe and black leather mask strides onto the platform. His voice, smooth and commanding, fills the room. \"Ladies and gentlemen, esteemed guests, welcome to tonight’s exclusive event. We have gathered some of the finest and most coveted items in the realm. May you bid wisely… and generously.\"\n\nAs the auctioneer gestures to an assistant, the first item is unveiled—a jeweled dagger, glinting ominously under the dim light. The crowd shifts with excitement as the bidding begins.","notes":"If the characters look for Silverhand, they can find him on a successful perception check.\n\nSeated near the back, yet still commanding an undeniable presence, he exudes an air of cold calculation. His tall, slender frame is cloaked in a dark, richly embroidered coat. His left hand, encased in an intricate gauntlet of polished silver, rests on the arm of his chair. Beneath his hood, only the lower half of his face is visible, showing a thin-lipped smirk that hints at both intelligence and ruthlessness. Though his face remains shadowed, everyone in the room knows who he is: the man who controls the flow of illicit goods and information in Kordavos.","npcs":[]},{"name":"A Relic of Old Valkara","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726455771790","narrative":"The crowd hushes as the auctioneer takes the stage once more, his eyes gleaming with anticipation. \"What I have next,\" he begins, his voice dripping with mystery, \"is truly one of a kind. Recovered from the depths of the Valkarr Forest—a relic of Old Valkara.\"\n\nThere’s a subtle shift in the room as interest piques, heads turning toward the stage.\n\nWith a dramatic sweep, he unveils an ancient map. The parchment, weathered by time, bears faint, intricate markings. \"This map,\" he continues, \"leads to an item of unknown origin—lost, forgotten, and waiting to be found. A mystery hidden in the wilds for centuries.\"\n\nBefore anyone can get too good a look at the route, the auctioneer dutifully returns the map to its protective case, obscuring the details from prying eyes. The auctioneer smiles slyly, sensing the growing anticipation. \"Now, let’s see who dares to take the first bid.\"","notes":"The characters may have expected this to be the Key, but it is instead a different relic. The Key is already in the possession of the Covenant of the Cowl.","npcs":[],"stages":[{"name":"The First Bid","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726463464761","narrative":"As the auctioneer's voice rings out, starting the bidding for the map, a tense silence falls over the room. Eyes dart nervously, and hands hesitate, knowing well the reputation of those who covet such rare treasures. \n\nFrom the back of the crowd, a figure steps forward—Silverhand’s representative, a tall man dressed in a sharp black coat. He raises a gloved hand calmly. “Ten thousand gold,” he states with an air of finality.\n\nSeated behind him sits an undeniable presence exuding an air of cold calculation. His tall, slender frame is cloaked in a dark, richly embroidered coat. His left hand, encased in an intricate gauntlet of polished silver, rests on the arm of his chair. Beneath his hood, only the lower half of his face is visible, showing a thin-lipped smirk that hints at both intelligence and ruthlessness. Though his face remains shadowed, everyone in the room knows who he is: the man who controls the flow of illicit goods and information in Kordavos.\n\nA murmur ripples through the crowd, but no one dares to speak. The weight of the bid—and more importantly, the man making it—casts a heavy shadow over the room. All know that to challenge Silverhand, even through his emissary, could mean far more than losing gold. The auctioneer pauses, scanning the room, but no one else dares lift their voice in opposition.\n\n\"Do I hear another bid?\" the auctioneer asks tentatively, his voice cracking slightly in the tense atmosphere. Silence. \"Ten thousand going once… going twice…\"","notes":"","npcs":[],"stages":[]}]},{"name":"The Winning Bid","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726458036467","narrative":"The gavel falls with a sharp crack. \"Sold—to the gentleman in black!\" the auctioneer proclaims, though his enthusiasm falters as the tension in the room thickens.\n\nWithout a word, Silverhand’s representative turns on his heel, slipping into the shadows with an air of purpose. A pair of silent guards fall in behind him, and together, they make their way toward the exit.","notes":"","npcs":[{"name":"Silverhand Representative","characterId":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726458565684"}]}]},{"title":"Silverhand","description":"Choosing to follow Silverhand after the auction could reveal deeper layers of the plot. He leads them through the winding streets to a hidden den beneath an abandoned warehouse by the docks. Here, amidst the remnants of his smuggling operations, Kazimir Raskov—notorious as Silverhand—deliberates his next move.","encounters":[{"name":"Shadowing Silverhand","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726462025424","narrative":"Late evening falls over Kordavos. The city’s streets are bathed in a dim, silvery glow from the moon hanging low in the sky. Silverhand strides purposefully away from the auction house, his cloak rippling in the faint breeze. The distant hum of the city’s nightlife fades as he and his two silent guards move through the winding alleys, the flickering street lanterns barely illuminating their cautious steps. \n\nThe air is thick with tension as they navigate the darkened streets, the threat of being spotted ever-present. Silverhand’s movements are deliberate, and the path he takes seems to lead deeper into the city’s forgotten corners, far from the watchful eyes of law and order.","notes":"Silverhand’s people are seasoned professionals, and following them undetected will require a group stealth or deception check. If they fail, the group is quickly noticed, and two of Silverhand’s guards subtly block their path in a narrow alley. The guards won’t initiate combat right away, but will issue a stern warning to \"mind their own business\" and leave. If the party presses, they can try persuasion or intimidation to continue the pursuit, but pushing too hard risks provoking a fight.\n\nIf they just attack, other Silverhand bodyguards will appear quickly to defend him. If any of the characters fall due to attacking him, they will wake up in a cell to be interrogated by Silverhand himself.","npcs":[{"name":"Silverhand","race":"","gender":"","characterClass":"","level":"","appearance":"","personality":"Cunning, enigmatic, and stealthy. Silverhand is always two steps ahead, calculating his movements precisely to avoid detection.","abilities":"","characterId":"silverhand","class":""},{"name":"Varchk","race":"Half-Orc","gender":"Male","characterClass":"Fighter","level":"4","appearance":"Muscular build with greenish skin, a prominent tusk jutting out from his lower jaw, and a scar that runs from his forehead to his cheek.","personality":"Loyal, stoic, and unwavering. Aldith is fiercely protective of Silverhand and follows orders without question.","abilities":"","characterId":"aldith","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726459305887"},{"name":"Kaeleth","race":"Human","gender":"Female","characterClass":"Mage","level":"5","appearance":"","personality":"Calm, observant, and sharp-witted. Kaelen’s keen senses and agility make her an excellent scout.","abilities":"","characterId":"kaelen","class":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726461750367"}]},{"name":"The Hideout","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726461696892","narrative":"The trail leads back to the docks, where the evening mist rolls in from the sea, shrouding the ships and warehouses in a thick veil of fog. The once-bustling port has grown eerily quiet, save for the distant creak of ropes and the occasional splash of waves against the pier. At the edge of the docks, they spot their destination—an abandoned warehouse, its weathered wooden walls barely visible in the dim light of a flickering lantern hung outside.\n\nThe building seems forgotten by time, with boarded-up windows and a rusted metal door hanging loosely on its hinges. Silverhand slips through the mist toward this inconspicuous hideout, his silver gauntlet catching the light briefly before he vanishes into the shadows. ","notes":"The adventurers have several options for getting inside Silverhand’s hideout, depending on their approach. Stealthy players might observe the building from the shadows, waiting for one of Silverhand’s guards to exit or for a moment when the door is left slightly ajar. A successful perception or investigation check could reveal a loose window on the upper floor or a back entrance hidden by crates and debris. If they possess spells such as invisibility or disguise, magic could allow them to slip past unnoticed or even pose as one of Silverhand’s own men.\n\nAlternatively, a more direct approach could involve bluffing their way inside. The adventurers might try to convince the guards they have business with Silverhand, requiring a high persuasion or deception check, especially if they claim involvement in the Black Market auction. Bribery could also work if they offer gold or a valuable item in exchange for entry. \n\nIf all else fails, combat is an option, though they would not likely succeed, and instead wind up as captives, subject to interrogation from Silverhand himself.\n\nOr another option is to assume Silverhand is aware he was followed and wants to meet this crew of adventurers to find out more about them, with his bodyguards not far away.","npcs":[]},{"name":"Face-to-Face with Silverhand","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726464286132","narrative":"Inside the dimly lit hideout, the scent of damp wood and smoke fills the air. The interior is stark, with low ceilings and walls lined with crates and sacks—no doubt filled with illicit goods. A faint flickering of candlelight from the far side of the room casts long shadows across the floor, making the cramped space feel even more confined. \n\nAt the far end of a long, weathered table, Silverhand sits, shrouded in the dim light of flickering lanterns. His presence dominates the room, his infamous silver gauntlet resting on the tabletop, the metal gleaming menacingly in the low light. His bald head shines faintly, but it’s his piercing eyes—cold, calculating, and dangerous—that capture attention. His dark, finely cut clothes hint at wealth, but the tension in his posture and the predatory stillness he exudes tell a story of violence and control. In front of him, a rare bottle of Hammerdeep whiskey sits uncorked, its deep amber liquid untouched, as though mocking any who might dare to indulge.\n\nWithout standing, Silverhand's gaze locks onto the adventurers as they step into the room. His voice cuts through the silence like a blade. \"You’re late.\" There’s no invitation in his tone, only cold accusation. He leans forward slightly, his silver-clad fingers tapping the table with a metallic clink that echoes ominously. \"I don’t like being followed. I like being interrupted even less.\"\n\nHe gestures lazily toward the empty chairs, though the gesture feels more like a command. \"Sit. You’ve gone through a lot of trouble to find me, but let’s be clear,\" his voice drops to a growl, his silver gauntlet flexing with unsettling precision, \"this is my domain. You are here because I have allowed it, and you leave when I decide.\" He takes a long, deliberate pause, eyes narrowing. \"Now, tell me why I shouldn’t have you thrown into the harbor, or worse.\"","notes":"This encounter could play itself out in a variety of ways.\n\nSilverhand is an alias used by Kazimir Raskov, the head of the Raskov Clan’s smuggling operations. He was in fact behind the operation to steal the Blackthorn shipment at the docks. However, he was double crossed by one of his men who was secretly a member of an organization known as the Covenant of the Cowl. \n\nKazimir wishes to avoid any direct confrontation with the Covenant. His instincts tell him that it is too dangerous. They seem to know everything, with spies operating everywhere. In fact, he is considering leaving the city to expand their operations elsewhere.","npcs":[{"name":"Silverhand","characterId":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726464320001","race":"Human","characterClass":"Rogue","gender":"Male","level":"8"}]}]},{"title":"Ambush","description":"On their return to the Dragonbone Inn, the adventurers are attacked by agents of the Covenant of the Cowl. Determined to eliminate those who get too close to the truth, the attackers fight ferociously. Capturing an agent could provide valuable information, but they are prepared to die to protect their secrets, creating a perilous encounter for the party.","encounters":[{"name":"The Ambush","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726580775048","narrative":"As the adventurers make their way back to the Dragonbone Inn, the streets of Kordavos are eerily quiet, bathed in the cold, pale light of a waning moon. The lanterns that line the narrow roads flicker weakly, casting long, twisted shadows across the cobblestones. The chill of the late evening air bites at their skin, and a heavy stillness hangs in the air.\n\nSuddenly, the sharp *thunk* of an arrow breaks the silence, embedding itself into the wooden door of a nearby shop, just inches from one of the adventurers. From above, a soft rustle catches their attention. The rooftops, dark and shrouded in shadow, hold the vague forms of hooded figures. Silent watchers, barely visible, but present.\n\nThen, without warning, a low rumbling voice, amplified and unnatural, reverberates through the narrow streets. \"*You tread where you are not welcome,*\" the voice booms, unnatural and echoing as if spoken from all directions at once. The air itself seems to tremble. The ground beneath their feet shudders slightly, cracks form in the nearby stone, and the faint scent of sulfur fills the air. From the rooftops, more arrows are nocked, but none are loosed.\n\n\"Cease your meddling,\" the voice continues, filled with cold authority. \"Turn your attention away from what is not yours to uncover, or the consequences will be far worse than arrows in the night.\" Another arrow whistles through the air, embedding itself in the wall just ahead of the adventurers, a clear warning.\n\nThe figures on the rooftops remain motionless, but their presence is overwhelming. The voice speaks once more: \"We are watching. We know every step you take. Keep searching, and you will find only ruin.\"","notes":"This encounter serves as a powerful psychological tactic by the Covenant of the Cowl to intimidate the adventurers rather than physically harm them. The use of magic, particularly Thaumaturgy, and the dramatic timing of the arrows are meant to create an atmosphere of unease and fear, reminding the party that they are constantly being watched. The adventurers should feel the weight of the Covenant’s influence and the very real threat that comes from crossing such a secretive and powerful organization. However, the absence of a direct attack gives the players the opportunity to choose their next steps without forcing combat, allowing them to consider the gravity of their investigation.","npcs":[{"name":"Cowled Rogue","race":"Human","gender":"Male","characterClass":"Rogue","level":"5","appearance":"A lithe, shadowy figure with a hooded cloak that hides his features, except for his sharp, glinting eyes.","personality":"Cold, calculating, and merciless.","abilities":"Expert marksman with a crossbow, skilled in stealth and agility.","characterId":"silas"},{"name":"Cowled Assassin","race":"Half-Elf","gender":"Female","characterClass":"Assassin","level":5,"appearance":"Slender and graceful, her narrow eyes gleam with a dangerous light beneath her deep hood.","personality":"Stoic, deadly, and fiercely loyal to The Cowl.","abilities":"Master of poisons and silent kills, exceptionally quick and agile.","characterId":"liora"}]}]}],"plot":"As the party enters the Lower Districts, they find its labyrinthine streets and alleyways quite different from the North End.\n\nThey will need to use their skills to attempt to locate the mysterious Black Market. As they wander the twists and turns of the cramped streets, it isn’t long before they experience an encounter with a group of halfling street urchins who attempt to pickpocket them and take the scroll case.\n\nThe black market is invitation-only. The adventurers must find a way to secure invitations or somehow gain access. The market itself is a maze of stalls selling illegal goods. It's bustling with nefarious individuals.\n\nOne of the stalls has Elven goods for sale that match the description of the items stolen from the ship. If pressed successfully for information, the merchant will reveal that he purchased the goods \n\nThey learn that a rare artifact connected to the Valkaran heritage is up for auction. They will think it may be the key, but it is actually an old map of some sort. Silverhand is there and will be bidding on the item.\n\nThe adventurers can choose to engage with Silverhand at their discretion. If they follow him, he will return to a hidden den beneath an abandoned warehouse by the docks.\n\nSilverhand is an alias used by Kazimir Raskov, the head of the Raskov Clan’s smuggling operations. He was in fact behind the operation to steal the Blackthorn shipment at the docks. However, he was double crossed by one of his men who was secretly a member of an organization known as the Covenant of the Cowl. \n\nKazimir wishes to avoid any direct confrontation with the Covenant. His instincts tell him that it is too dangerous. They seem to know everything, with spies operating everywhere. In fact, he is considering leaving the city to expand their operations elsewhere.\n\nOn their way back to the Dragonbone Inn, they are ambushed by agents of the Covenant of the Cowl. The leaders of the Covenant have decided that the adventurers are getting too close to the truth and must be eliminated. None of the attackers will allow themselves to be captured. \n\nIf they must flee, they will retreat to their secret underground tunnels, disappearing behind a door that gets magically sealed behind them. If captured, they will reveal nothing and attempt to ingest a cyanide pill. If somehow the adventurers are able to use a charm person or other means, it is possible they could get one of the attackers to reveal the existence of the Covenant’s secret underground network. They will not reveal the connection of the Cowl to the Valtor clan as they do not have knowledge of it."},{"title":"The Masquerade Ball","plot":"The masquerade ball is a dazzling affair, held in the opulent halls of the Blackthorn mansion. The architecture blends Valkaran artistry with Asterian sophistication, featuring soaring ceilings, marble columns, and intricate carvings depicting legendary tales. \n\nThe adventurers don elaborate costumes and masks, ready to blend in with the elite of Kordavos. As they enter, the stark contrast between the lavishness of the mansion and the modest living conditions they've observed elsewhere in Kordavos is quite apparent. Whispers among some guests hint at disapproval of such extravagance, especially during times when many Valkarans struggle.\n\nLady Astrid will graciously greet the party and introduce them to her brother Thaddeus, the Patriarch of the Blackthorn Clan. He thanks them for their actions at the docks, and suggests an alliance. He needs strong people to help him mold the future of Davos in close alignment with the Margrave, Aeron Davos. \n\nIn reality, the Blackthorns seek to gain more power, glory and wealth for themselves, with little regard or even at the expense of other Valkarans. Astrid is using her knowledge of the forest and beast mastery to engage with the elves to discover hidden wealth and powerful artifacts of the lost glory days of Valkara for the Blackthorns, and those that have chosen to align with them. Her brother is a political force, with ambitions to become a key ally to the Margrave of Davos and the Asterians.\n\nFor all those who choose to align themselves with the Blackthorns there is opportunity for wealth and power. Thaddeus is proud and dismissive of the opposition as crude thieves and weak minded fools who cling to the past.\n\nLater when the characters are on their own, Seraphina Valtor will introduce herself along with her personal guest and spiritual advisor, Bishop Nikolai Petrov. After comparing the extravagance of the ball and mansion to the living conditions of ordinary Valkarans, they talk about how they were once a proud and mighty people. Now, regretfully, they seem to be losing their heritage.\n\nSeraphina Valtor is in actuality the leader of the Covenant of the Cowl. She is aware that the adventurers are snooping around and will subtly probe to find out if the characters know about the key, its location or how close they are to finding it. The bishop covertly leads a faction of the church that is secretly connected to the Valtor Clan and allied with the Covenant.\n\nIf the characters snoop around the mansion, they may be able to find various clues, such as shipping manifests, correspondence with the Valkarr elves and potentially even financial records that document fraudulent transactions benefiting a ‘Drakovan’ family. If they are especially bold, they can even find an old tome hidden in Astrid’s quarters, written by Milos Antonov with all of his notes on the Key of Ilmarin. The tome was in fact stolen when Joran’s father was poisoned by Astrid herself.\n\nAs the intrigue of the evening builds, Thaddeus takes the stage to proclaim a new era of prosperity for those who align with the Blackthorns and the Asterians. \"We stand on the brink of greatness. Those who cling to outdated traditions will be left behind.\"\n\nIf the forest drake has not been killed, he will proudly reveal it as an additional example of new opportunities from forging a relationship with the elves. If the forest drake is not available, Eamon the half-elf they had met at the Dragonbone Inn will instead conjure an impressive illusion.\n\nAt this moment, a covert assassin, donned in the garb of the Covenant, will take advantage of the distraction and stab Thaddeus with a poison dagger. “Death to the murderer of Milos Antonov!” The killer will then immediately attempt to escape out the balcony behind him, descending down a rope, into a secret tunnel in the basement. At the end of the tunnel is a door, which will be sealed shut behind him and locked with a magic seal. ","scenes":[{"title":"The Blackthorn Mansion","encounters":[{"name":"Entry to the Ball","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726597339022","narrative":"The Blackthorn Mansion looms ahead, its towering spires silhouetted against the darkening sky. Flickering torchlight illuminates the imposing stone walls, casting long, shifting shadows that dance across the mansion’s façade. Wrought iron gates, adorned with intricate Valkaran and Asterian symbols, stand open, welcoming the evening’s elite. Servants in finely tailored uniforms guide carriages through the cobblestone courtyard, while guests draped in lavish costumes and ornate masks make their way up the grand staircase leading to the entrance.\n\nAt the foot of the grand staircase, two imposing guards, clad in polished black armor adorned with the Blackthorn family crest, stand vigilant. Their hands rest casually on the hilts of their sheathed swords, but their watchful eyes dart over each guest with practiced precision.\n\nOne of the guards steps forward, a burly man with a red beard and imposing frame that seems familiar. \n\nNow, though, Barok looks far more composed, with his unruly beard neatly trimmed and his posture straighter, as if the formal attire demands a certain level of dignity. His eyes narrow in recognition as the adventurers approach, but he says nothing of their prior encounter. Instead, he steps forward, raising a gloved hand.\n\n\"Invitation,\" he grunts, his voice as gruff as they remember, though more restrained in this refined setting. His eyes scan each of them, lingering a moment longer than necessary, a hint of recognition on his face.","notes":"This guard is the same man they encountered during the Harvest Festival brawl—Barok, the rough-edged leader who had been quick to escalate tensions between rival Valkaran clans. \n\nIf the adventurers previously sided with Barok, he’ll be more accommodating and might allow them in with minimal scrutiny. If they opposed him, Barok will be unfriendly, scrutinizing their invitations and potentially causing a delay unless persuaded or intimidated. In a neutral scenario, Barok remains professional, checking their invites efficiently but becoming confrontational if disrespected.","npcs":[{"name":"Barok Redbeard","race":"Human","gender":"Male","characterClass":"Fighter","level":"3","appearance":"Burly frame with a neatly trimmed red beard, wearing polished black armor adorned with the Blackthorn family crest.","personality":"Gruff but dignified, vigilant, holds grudges from past encounters.","abilities":"Proficient in hand-to-hand combat and swordsmanship, keen observational skills.","characterId":"barok-ironfist","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726597353909"},{"name":"Door Guard","characterId":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726597363187","race":"Human","characterClass":"Fighter","gender":"Male","level":"2"}]},{"name":"Inside the Ball","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726605687900","narrative":"As the adventurers step through the grand entrance of the Blackthorn Mansion, they are immediately enveloped by the opulence of the Masquerade Ball. The soaring ceilings stretch high above, supported by elegant marble columns adorned with gold filigree. Along the walls, intricate carvings tell the stories of Valkaran legends, their craftsmanship blending seamlessly with the sleek, Asterian-style architecture that dominates the room. Crystal chandeliers cast a warm glow over the scene, refracting light onto the polished stone floors and the vibrant tapestries that hang from every wall.\n\nThe ballroom itself is a dazzling display of wealth and power, where nobles, merchants, and influential figures from across Kordavos gather in elaborate costumes and masks. Tables laden with exotic delicacies, goblets of rare wines, and displays of gemstones glimmer under the soft light. The air hums with laughter, music, and whispered conversations, creating a stark contrast to the modest and often struggling lives the adventurers have witnessed in the city outside.\n\nAs they take in the splendor of the room, the disparity between this lavish celebration and the hardships endured by the common Valkarans becomes painfully clear. Here, in the heart of the Blackthorn’s domain, wealth flows freely, and the concerns of the outside world seem distant, almost forgotten. The adventurers can sense that beneath the glittering surface, deeper currents of intrigue and ambition swirl among the guests.","notes":"If the characters listen or pass a perception check, they can hear whispers among some guests hint at disapproval of such extravagance, especially during times when many Valkarans struggle. Others admire the Blackthorn’s forward thinking.\n\nFrom behind elaborate masks, a few guests murmur in hushed tones, expressing quiet disapproval of the Blackthorns’ extravagance. \"All this, while many in the city can barely afford bread,\" one voice whispers, her tone sharp with judgment. Another adds, \"They’ve forgotten their roots... forsaking the people for Asterian opulence.\"\n\nYet, not all share this sentiment. Other guests admire the Blackthorns' ambition and speak of their \"forward-thinking\" ways. \"They know how to seize opportunity,\" says a man in a richly embroidered cloak. \"In times like these, it’s visionaries like him who will secure the future of Kordavos.\"","npcs":[]},{"name":"The Blackthorns","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726591063592","narrative":"A striking woman walks toward the new arrivals, her elaborate gown shimmering under the soft glow of chandeliers. She moves with effortless grace, her face obscured by a golden mask adorned with intricate details. \n\n\"Welcome to our humble gathering,\" she says, her voice smooth but commanding, her eyes scanning the party with a keen interest. \"I’m so delighted that you have come.\" \n\nShe pauses, letting the tension hang for just a second longer before her hand reaches up to remove the mask. With a graceful flourish, the mask falls away, revealing the familiar face of Lady Astrid Blackthorn. Surrounded by luxury and opulence, she is almost unrecognizable from the rugged ranger they fought alongside in the chaos of the docks. Now, in her elaborate attire, she exudes an air of nobility and control.\n\n“I must admit, you’ve piqued my interest since our little encounter at the docks. Not many handle themselves so well in such chaotic circumstances.”\n\nShe glances around the room, the faintest hint of pride in her gaze. “But tonight... tonight is a different kind of challenge. You’ll want to meet my brother, Thaddeus. He has a keen eye for talent and understands the value of... skilled allies.” Astrid offers a knowing smile. “He’s a man of vision, and if you’re the type who seeks to rise above the fray, I think you’ll find him quite compelling. Shall we?”","notes":"As the conversation progresses, Astrid will suggest introducing them to her brother, Thaddeus Blackthorn, who holds more political sway and could offer them valuable connections. She will make it clear that the Blackthorn family rewards those who prove to be valuable allies, planting seeds of intrigue about what future opportunities may await them.\n\n\"You’ll want to meet my brother, Thaddeus. He has a keen eye for talent and understands the value of... skilled allies.” Astrid offers a knowing smile. “He’s a man of vision, and if you’re the type who seeks to rise above the fray, I think you’ll find him quite compelling. Shall we?”","npcs":[{"name":"Astrid Blackthorn","characterId":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726590994792","race":"Human","characterClass":"Ranger","gender":"Female","level":"6"}],"stages":[{"name":"Meeting Thaddeus","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726605568064","narrative":"A tall and broad-shouldered noble stands prominently in the mansion’s grand rotunda, his dark hair slicked back to reveal a sharp, angular face that exudes confidence and control. His piercing blue eyes seem to take in every detail, his lips curling into a smile that never quite reaches them, hinting at the calculated nature beneath his polished exterior. tall amidst a group of finely dressed nobles. His attire is immaculate, adorned with symbols of both Valkaran heritage and Asterian influence, blending the old world and the new. \n\n“Ah, so these are the capable individuals my sister has spoken of,” Thaddeus begins, his voice smooth and measured. He extends a hand in greeting, though his eyes betray the fact that he is already assessing them. “I must say your arrival in Kordavos have not gone unnoticed.”\n\nHe gestures for them to step closer, away from the crowd. “The March of Davos is at a turning point. The old ways, while noble in their time, can only hold us back. The Margrave sees the future, and so do I. Those with the foresight to align themselves with progress—well, they stand to benefit greatly. Wealth, influence, power... it’s all there for those who aren’t afraid to reach for it.” \n\nHis tone shifts slightly, growing colder as he speaks of the opposition. “Of course, there are always those who resist change. Crude, small-minded fools clinging to traditions long past their prime. But their time is ending.”\n\nThaddeus pauses, offering a sly smile. “Consider this an invitation. Align yourselves with the Blackthorns, and there’s no telling how far we might go together. But choose your path carefully. Not everyone in this city is fit to be part of what’s to come.”","notes":"After exchanging a few more pleasantries and gauging the adventurers' reactions, Thaddeus offers a final, cordial smile. \"Consider my offer, but don’t delay too long. Opportunities such as these have a way of slipping through one’s fingers,\" he says smoothly. With a nod to his sister, he adds, \"Astrid, we have other guests to attend to.\"\n\nAstrid gives the adventurers a lingering glance before turning to follow her brother. \"Enjoy the evening, friends. I’m sure we’ll speak again soon,\" she says, her voice warm but hinting at an underlying calculation. Together, the Blackthorn siblings slip into the crowd, leaving the adventurers free to enjoy the opulent surroundings of the masquerade ball.\n\nThaddeus carries on his person a key to his desk and the basement vault—a small yet intricately designed object, reflecting the wealth and attention to detail that defines the Blackthorn patriarch. Forged from polished black iron, the key’s shaft is engraved with delicate filigree patterns that resemble twisting vines, perhaps a nod to the Valkaran heritage the Blackthorns claim to preserve.\n\nThe head of the key is set with a dark, glimmering onyx stone, subtly enchanted to enhance its durability and prevent it from breaking or bending under pressure. This stone also serves as a focus for the desk’s arcane security, interacting with the lock’s magical components to ensure only Thaddeus—or someone with his key—can open it safely. At the base of the key, where it attaches to a finely braided leather cord, a tiny emblem of the Blackthorn family crest is etched, a small reminder of the power and influence behind it.","npcs":[{"name":"Thaddeus Blackthorn","characterId":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726605980934","race":"Human"}],"stages":[]}]},{"name":"The Lady and The Bishop","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726609502768","narrative":"As the adventurers mingle among the masked guests of the ball, they are approached by a pair of figures moving with purpose through the crowd. One is an elegantly dressed woman, her poise regal, her movements deliberate and graceful. Beside her walks a tall man in ornate clerical robes, his presence calm yet commanding. Both wear ornate masks, but as they come to stand before the adventurers, the woman reaches up and removes hers with a respectful nod, revealing striking features and piercing eyes. The bishop follows suit, lowering his mask to reveal a stern yet composed face.\n\n\"Good evening,\" the woman begins, her voice smooth and deliberate. \"I am Seraphina Valtor, and this is Bishop Nikolai Petrov.\" She offers a respectful nod, while the bishop inclines his head in silent greeting. \"It seems you are not the typical guests here,\" Seraphina adds, her eyes sweeping over the adventurers, assessing them. She gestures subtly to the grand surroundings, her gaze settling on the opulence of the ballroom. \"Such grandeur on display, while so many of our people suffer... It’s an unfortunate contrast, don’t you think?\"\n\nBishop Nikolai speaks, his voice measured. \"We were once a proud and mighty people, deeply connected to our heritage. Now it seems some have forgotten what made us strong.\" His tone carries a hint of regret, but also resolve. \"There are those who still believe in preserving what truly matters.\"\n\nSeraphina’s eyes meet each of the adventurers', her expression intent. \"The Blackthorns have ambitions, of course. But not everyone shares their vision for our future. I wonder if people such as yourselves might be interested in... a different way forward.\" She pauses, lowering her voice. \"One that respects where we came from and what we stand to lose.\"","notes":"Seraphina Valtor is in actuality the leader of the Covenant of the Cowl. She is aware that the adventurers are snooping around and will subtly probe to find out if the characters know about the key, its location or how close they are to finding it. The bishop covertly leads a faction of the church that is secretly connected to the Valtor Clan and allied with the Covenant.","npcs":[{"name":"Seraphina Valtor","characterId":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726609419379","race":"Human","gender":"Female"},{"name":"Bishop Nicolai","characterId":"","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726609448307","race":"Human","characterClass":"Priest","gender":"Male","level":"5"}],"stages":[{"name":"A Conversation with Seraphina","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726609667621","narrative":"As Seraphina Valtor continues the conversation with the adventurers, her questions take on a more subtle yet probing nature. Her tone remains pleasant, but there’s a discernible shift, as if she’s testing the waters for hidden truths. \n\n\"You know,\" she begins, glancing around at the extravagant ball, \"Kordavos has always been a place where power and history intersect. It’s curious, really, how much of our heritage has been lost or, perhaps… *misplaced.*\" Her eyes linger on the adventurers, gauging their reactions. \"There have been whispers—rumors, really—that certain families in Kordavos are not content with their wealth and standing. They’re seeking to acquire more. And not just in gold or influence, but in things that truly belong to the Valkaran people.\"\n\nShe lowers her mask, as does the bishop, her expression calm but sharp. \"It’s said that the Blackthorn family has been collecting relics—items of great historical and cultural significance. Some believe they’re doing so to curry further favor with the Asterians, perhaps even to strengthen their grip on the city. These items… they should be safeguarded by those who truly understand their value, don’t you think?\"\n\nBishop Nikolai, standing quietly beside her, fingers his silver chain with the symbol of Thyra, his eyes narrowing slightly. Seraphina leans in, her voice soft but pointed. \"Have you come across anything like that in your recent travels? Something that might help preserve our people’s true legacy?\" ","notes":"Her words, while delicate, are unmistakably fishing for any knowledge the adventurers might hold regarding the Key of Ilmarin. All the while, the bishop watches, ready to interject if needed, casting the adventurers in a web of intrigue where power, heritage, and ancient secrets intertwine.","npcs":[],"stages":[]}]}]},{"title":"Exploring the Mansion","encounters":[{"name":"A Distraction","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726622649291","narrative":"The ballroom's murmur of conversation quiets, Lady Astrid Blackthorn steps forward, her voice smooth and commanding as she addresses the crowd. Her lips curl into a proud smile, and her eyes scan the room, lingering on the adventurers for a moment before she continues.\n\n\"Ladies and gentlemen, honored guests, tonight we celebrate not just our prosperity but our alliance with the ancient people of the Valkarr Forest. In keeping with this celebration, I am pleased to introduce a very special guest, an emissary from our elven allies. Please welcome Aelindor, master bard of Faelendar, who will honor us with the Song of the Eldertree.\"\n\nThe grand doors of the ballroom swing open, and all eyes turn as a tall, ethereal elf strides into the room. His silver hair shimmers under the chandelier light, and his long, flowing robes of green and silver seem to blend with the very air around him. Across his back, he carries an ornately carved lyre made from the heartwood of an ancient tree, its strings glinting like threads of moonlight.\n\nAelindor steps gracefully to the center of the ballroom, offering a respectful nod to Astrid before he faces the gathered crowd. His voice is as smooth as flowing water. \"It is an honor to stand before you. Tonight, I share a song from my people—the Song of the Eldertree. It speaks of the forest’s eternal wisdom and the bond between our people and this land.\"\n\nHe begins to strum the lyre, and an ethereal melody fills the air, soft and haunting, as if the very forest itself is whispering through the strings. The music weaves through the crowd, drawing them in, and for a moment, it feels as though the ballroom has been transported to the heart of the ancient woods. \n\nIt also could serve as the perfect distraction should someone in the crowd of attendees wish to slip away.","notes":"","npcs":[]},{"name":"Through the Halls","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726623933022","narrative":"A dimly lit hallway stretches out, the flicker of a distant candle casting long shadows on the stone walls. Pressing forward, the sound of the party grows faint, replaced by the soft creak of wood underfoot and the low murmur of their own movements.\n\nThe hall ends with a staircase rising on the left, spiraling upwards to the higher levels of the mansion, its bannisters polished and ornate, hinting at more luxurious chambers above. On the right, a narrow set of steps descends into the bowels of the mansion, where the air grows cooler, and the faint scent of aged wine or damp stone lingers.","notes":"","npcs":[]},{"name":"The Ranger’s Quarters","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726624593921","narrative":"On the upper floors, the sounds of the masquerade ball below become distant echoes, leaving only the subtle creak of wood and the occasional gust of wind rattling the ornate windows.\n\nAt the end of a long corridor adorned with portraits of the Blackthorn family, is a heavy door carved with intricate designs of twisted branches and forest creatures—symbolic of the Blackthorn clan’s connection to the Valkarr Forest. ","notes":"The door is locked.","npcs":[],"stages":[{"name":"Inside Astrid’s Quarters","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726624812656","narrative":"Inside, the room exudes a rustic elegance, a blend of Blackthorn wealth and her deep connection to the wilderness. Animal pelts line the floor, while the walls are decorated with mounted hunting trophies and maps of the Valkarr Forest. A large wooden desk stands near the window, scattered with papers, maps, and various trinkets—a reflection of Astrid’s meticulous planning and her ties to the Valkaran wilderness.\n\nA smaller door in the back leads to a private study, where the faint scent of old leather and ink lingers in the air. On the desk, a few open books rest alongside a locked chest. A hunting bow is propped against the wall, and on the shelves, there are tomes and scrolls detailing elven lore and forest creatures.","notes":"With the right dice rolls, they can discover a hidden compartment.","npcs":[],"stages":[]},{"name":"The Hidden Compartment","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726624846273","narrative":"As the adventurers explore Astrid’s private study, they notice a faint draft coming from one of the bookcases, as if air is slipping through the cracks. Upon closer inspection, they find a small mechanism hidden within the intricate carvings along the side of the shelf. With a click, the bookshelf swings open, revealing a narrow compartment behind it.\n\nInside the hidden compartment is a worn, leather-bound journal. Its edges are frayed, and the pages are filled with the meticulous handwriting of a scholar. The cover bears the initials \"M.A.\" \n\nThe pages reveal sketches, historical notes, and cryptic clues tied to forgotten relics. It's now clear that Astrid had stolen this journal after orchestrating Milos's death, concealing it to keep its valuable knowledge for her own purposes.","notes":"This is the very journal that Joran had been desperately searching for, believed lost when his father was murdered. The journal contains Milos Antonov’s research on ancient Valkaran artifacts, most notably his detailed investigation into the Key of Ilmarin and its significance to Valkaran history.\n\nThis journal represents both the culmination of Milos’s life’s work and the key to unraveling the truth behind his death—a truth the adventurers now hold in their hands.","npcs":[],"stages":[]}]},{"name":"The Lavish Corridor","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726672244509","narrative":"Through the winding hallways of the mansion is a section of the estate clearly reserved for the highest-ranking member of the Blackthorn family. The lavish decor gradually becomes even more ornate—walls adorned with rich tapestries, priceless paintings depicting scenes of conquest and glory, and opulent candelabras casting a warm golden glow along the corridors.\n\nTwo guards stand blocking the way. Behind them is a large, intricately carved door. Both guards, clad in dark leather reinforced with iron plating, wear the unmistakable crest of the Blackthorn family—a black tree twisted into a circle—stitched into their tabards. \n\nThough they wear the family crest and carry longswords, their postures are relaxed, and their conversation seems far more focused on the lavish spread at the Masquerade than any potential threats. The hallway is otherwise silent, the muffled sounds of the Masquerade Ball barely audible from this far into the mansion\n\nOne of the guards, a stocky man with graying hair, leans against the wall, absently fiddling with the straps of his armor. His companion, a younger guard with a scruffy beard, lets out a soft chuckle as he mutters something under his breath about the wine and roasted game downstairs. Neither seems particularly interested in the goings-on beyond the door they’re meant to protect, though they still cast occasional glances down the hall.","notes":"Unlike the highly alert soldiers in the main hall, these guards appear more complacent, their attention divided between their conversation and the events below. While they aren't entirely inattentive, they seem far more approachable and easier to influence.\n\nFriendly Conversation: A well-timed conversation or compliment about the Masquerade could distract them further, offering the party a chance to slip by unnoticed.\n\nSmall Bribe: These guards don’t seem too proud to accept a little \"encouragement.\" A few gold coins or a rare drink from the ball might make them more inclined to turn a blind eye.\n\nConvincing Story: Given their relaxed demeanor, the adventurers could easily convince them that Thaddeus had summoned them for an urgent discussion or delivery.\n\nMagical Assistance: Given how at ease they are, even a simple illusion or Charm Person spell could sway them with little resistance.","npcs":[],"stages":[{"name":"Thaddeus’s Door","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726755558247","narrative":"At the end of the hall, is the grandest, most intricately carved door in the mansion. The wood is dark and polished, with the crest of the Blackthorn family—an ominous black tree twisted in a circle—emblazoned on its center.","notes":"The door is locked of course.","npcs":[],"stages":[]}]},{"name":"Thaddeus Blackthorn’s Private Chambers","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726695978966","narrative":"Beyond the door to Thaddeus Blackthorn’s private chambers is a stark contrast to the opulence of the rest of the mansion. The room is grand, but there’s a certain coldness to it—no lavish decorations or personal touches, just polished dark wood and expensive furnishings, all meticulously arranged.\n\nThe centerpiece of the room is an imposing mahogany desk, its surface covered in organized stacks of papers, ledgers, and maps. Behind the desk, a large window offers a sweeping view of the moonlit city of Kordavos, though thick velvet curtains are half-drawn, as if to limit just how much can be seen. \n\nAlong the walls are rows of shelves, but instead of books, they hold scrolls and sealed letters, many marked with the insignias of various prominent families, including the Blackthorn and Asterian crests. A glass cabinet in one corner houses rare and valuable trinkets—gems, ornate daggers, and a few peculiar objects that seem out of place, including a small carved wooden idol of Valkaran origin.\n\nTo the side, an ornate sword hangs mounted on the wall, its scabbard adorned with intricate Valkaran symbols. The hilt gleams in the firelight, drawing the eye as if it holds significance beyond mere decoration. A second door, almost hidden behind a heavy tapestry, leads to what seems to be a smaller, more private study.\n\nThis is clearly a place where business is done—deals struck, secrets kept, and plans formed. The atmosphere is thick with ambition and power, and it’s easy to imagine Thaddeus sitting behind the desk, orchestrating his plans to rise further in Kordavos’s political landscape.","notes":"The ornate long sword is lightly enchanted to slightly increase accuracy and damage. ","npcs":[],"stages":[{"name":"The Desk","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726777118249","narrative":"The imposing desk in the center of the room is immaculately organized, with a few unremarkable ledgers and papers neatly arranged. However, a small but intricate lock built into one of the desk drawers hints at something more valuable hidden within.\n\nUpon closer inspection, it’s clear that the lock has been custom-designed, crafted by a master locksmith—perhaps even with arcane assistance. The keyhole is lined with faint engravings, barely visible to the untrained eye, and small runes subtly glow when tampered with. This mechanism is a blend of mechanical precision and magical security.","notes":"The lock on Thaddeus's desk is no ordinary mechanism. If the trap is triggered have the players roll a dexterity check:\n\nWithout warning, an arc of blue lightning crackles and surges from the metal components, leaping out toward anyone standing near. The room is briefly illuminated by an arcane electrical discharge, casting long, jagged shadows on the walls.\n\nIf they take the full damage, it is possible they could be rendered unconscious and wake up in a cell in a secret Blackthorn dungeon.\n\nIf they manage to bypass the lock and trap, either through skilled hands or magic, the drawer slides open to reveal a single, finely bound ledger. The ledger’s cover is made of black leather, and inside, the entries are written in neat, flowing script, detailing secretive transactions between the Blackthorn family and the elves of the Valkarr Forest.\n\nThe records are precise, listing dates, shipments, and the exchange of valuable artifacts—ancient relics from Old Valkara, including weapons, trinkets, and objects of mysterious power. \n\nAmong the listed items, one particular entry stands out: \"The Key of Ilmarin, acquired through negotiation, to be delivered in secret.\" ","npcs":[],"stages":[]}]},{"name":"The Wine Cellar","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726777134645","narrative":"Descending the stone staircase, the air grows cooler, carrying with it the faint scent of damp earth and aged wood. The faint hum of the masquerade ball above slowly fades away, replaced by the distant echoes of dripping water and the creak of wooden barrels settling in the darkness below. The staircase is narrow and spirals down into the depths of the Blackthorn mansion, the flickering light of their torches casting long, distorted shadows on the walls.\n\nAt the bottom, they find themselves in a dimly lit corridor that leads to the wine cellar. Rows of old oak barrels are stacked high, alongside shelves lined with bottles of the finest vintages, some covered in dust, their labels faded with age. ","notes":"Allow the characters to plot out their action, then roll a perception check to see if they hear footsteps from the stairway.","npcs":[],"stages":[{"name":"The Sommelier","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726777163635","narrative":"The soft patter of footsteps echoes down the stone staircase, accompanied by muted voices. Emerging from the shadows of the upper mansion, the sommelier steps into view—a tall, wiry man with graying hair slicked back neatly, his sharp nose tilted upward as he descends. He wears the crisp, formal attire of the Blackthorn staff, a silver brooch gleaming on his lapel. His thin lips are pursed in mild irritation.\n\nBehind him, a younger servant, shorter but stockier, hurries down the stairs carrying a small notepad and a faint sheen of sweat on her brow. Her round face is flushed from the heat of the ballroom above, and she looks far less composed than the sommelier.\n\n\"I told you, we need the 407 Dronis red for the toast,\" the sommelier snaps impatiently, his tone leaving little room for error. \"It must be perfect.\" He scans the shelves as he enters, eyes narrowing.\n\n","notes":"There is limited time to make a decision: remain hidden among the barrels, attempt a distraction, or perhaps even bluff their way through the encounter by pretending to be servants or patrons inspecting the cellar.\n\nIf the players manage to have time to properly search the cellar, they may roll to check if they can discover the Hidden Alcove.","npcs":[{"name":"Clive Stonebrook","race":"Human","gender":"Male","characterClass":"Sommelier","level":"3","appearance":"Tall, wiry man with graying hair slicked back neatly. Wears crisp, formal attire of the Blackthorn staff with a silver brooch on his lapel. Has a sharp nose and thin lips, often pursed in mild irritation.","personality":"Impatient, meticulous, and holds high standards when it comes to his duties. Rarely smiles and expects perfection from those around him.","abilities":"Knowledge of wines","characterId":"clive-stonebrook","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726777234195"},{"name":"Mira Hearthstone","race":"Human","gender":"Female","characterClass":"Servant","level":1,"appearance":"Shorter but stockier young woman with a round, flushed face and a faint sheen of sweat on her brow. Wears simple but neat servant attire and carries a small notepad.","personality":"Nervous, eager to please, and slightly clumsy but hardworking. Looks up to her superiors and is determined to do a good job despite her occasional mistakes.","abilities":"Diligence, basic knowledge of household tasks, quick learner.","characterId":"mira-hearthstone","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726777443914"}],"stages":[]},{"name":"The Hidden Alcove","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726777363275","narrative":"Row upon row of bottles line the dimly lit corners of the wine cellar, some covered in a fine layer of dust. Something about the ornate wooden wine rack set against the furthest stone wall feels off. At first glance, it appears like any other rack, holding a variety of expensive and rare vintages. \n\nHowever, upon a closer look, this particular rack seems sturdier, its wooden frame slightly different in color as though newer than the rest. Upon closer examination, they discover that the rack doesn’t sit flush with the stone wall behind it. A faint, almost imperceptible seam runs along the edges, and the dust on the floor reveals subtle scuff marks near its base, as if it had been moved recently.\n\nFurther investigation reveals a hidden latch cleverly disguised as a wine bottle, its label faded and peeling. When the bottle is pulled, there’s a soft click, followed by a low rumbling sound as the entire wine rack shifts slightly. \n\nSlowly, the rack slides away from the wall on hidden tracks, revealing a narrow alcove behind it with a small, but heavily fortified vault door. In the center of the door is a complex lock mechanism of an unusual design—no simple keyhole, but rather an elaborate mechanism with several moving parts that interlock like a puzzle.\n\nIt’s clear that the lock has been custom-designed, crafted by a master locksmith—perhaps even with arcane assistance. The keyhole is lined with faint engravings, barely visible to the untrained eye, and small runes subtly glow when tampered with. This mechanism is a blend of mechanical precision and magical security.","notes":"If the trap is triggered have the players roll a dexterity check:\n\nWithout warning, an arc of blue lightning crackles and surges from the metal components, leaping out toward anyone standing near. The room is briefly illuminated by an arcane electrical discharge, casting long, jagged shadows on the walls.\n\nIf they take the full damage, it is possible they could be rendered unconscious and wake up in a cell in a secret Blackthorn dungeon.","npcs":[],"stages":[]},{"name":"Archives of the Drakovan","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726778953924","narrative":"As the vault door is opened, the air within the small chamber beyond feels cooler, stale as if it hasn’t been disturbed in years. Inside is a meticulously organized archive, the walls lined with shelves containing scrolls, ledgers, and bound volumes, all emblazoned with the sigil of a ‘Drakovan’ family\n\nHere it seems, the secrets of this powerful house lie hidden, with records of ancient dealings, maps of forgotten lands, and documents of alliances that stretch back to a time before the Asterians arrived. The scent of old parchment fills the air, mingling with the faint smell of aged wine, creating an atmosphere thick with forgotten history.","notes":"The Drakovan archives reveal a darker history of the family, long before they rebranded themselves as the Blackthorn Clan to align with the Asterian settlers. The documents trace their rise to power and wealth through a series of corrupt dealings, shady alliances, and blackmail. The Drakovans were known to form secret pacts with smugglers and bandit groups, leveraging these alliances to undermine their rivals and seize control of key trade routes in the region. They also engaged in illegal land grabs, manipulating local leaders and using forged documents to claim ancestral Valkaran lands. These methods allowed them to amass considerable influence, all while keeping their actions hidden from the public eye.\n\nThe decision to rebrand as the Blackthorn family was a calculated move to cleanse their image and gain favor with the Asterians. However, the archives show that the Drakovans never fully abandoned their ruthless practices. \n\nThese documents would be enough to bring down the entire clan faction should they be brought to the attention of the authorities and the public.","npcs":[],"stages":[]}]}]},{"title":"Murder in the Mansion","encounters":[{"name":"The Speech","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726779752897","narrative":"As the adventurers make their way back to the ballroom, the atmosphere has shifted into one of eager anticipation. The lights flicker and dance across the grand hall, casting a warm glow on the elegantly dressed guests. Thaddeus Blackthorn is confidently on the stage, his dark, formal attire gleaming under the chandelier light. His presence commands attention, and the entire room falls silent as he raises his hand, a proud smirk playing across his face.\n\n“Ladies and gentlemen,” Thaddeus begins, his voice booming with the practiced ease of a seasoned leader. “We stand on the brink of greatness. A new era of prosperity awaits those who are bold enough to embrace it. For those who align themselves with the Blackthorns and the Margrave, opportunity and wealth will follow. But,” he pauses for emphasis, his gaze sweeping across the room, “those who cling to outdated traditions will be left behind. The future belongs to those who dare to seize it.”\n\nAs the crowd murmurs in approval, Thaddeus gestures toward the far side of the ballroom. With a flourish, a large curtain is drawn back to reveal the Forest Drake, caged but still impressive in its size and power. The creature's green scales shimmer, its bright eyes surveying the crowd with an intense, predatory focus. \"Behold,\" Thaddeus announces proudly, \"a symbol of the new alliances we've forged with the elves of the Valkarr Forest. Together, we will unlock the ancient secrets of the wilds and bring forth untold riches and power!\"\n\nThe crowd gasps in awe, as the drake towers above, its translucent form shifting and shimmering.","notes":"If the Forest Drake is unavailable, the half-elf Eamon steps forward, his hands weaving intricate patterns in the air. A moment later, an illusion of the Forest Drake takes form—so realistic it almost seems to breathe.","npcs":[]},{"name":"Death to the Murderer!","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726789587556","narrative":"As the applause for Thaddeus' grand announcement reaches its peak, a figure in the shadows moves with purpose. Clad in the dark, hooded garb of the Covenant of the Cowl, the assassin has been biding his time, waiting for the perfect moment amidst the excitement and spectacle of the Forest Drake's reveal.\n\nWith a sudden, calculated movement, the assassin breaks from the cover of the crowd gathered near Thaddeus. In one swift motion, a blade plunges into Thaddeus’ side, the assassin hissing, “Death to the murderer of Milos Antonov!” Thaddeus gasps, his eyes wide in shock as the poison begins to work its way through his veins.\n\nChaos erupts. Guests scream and scatter as the assassin spins around, heading for the balcony with deadly speed. The figure vaults over the bannister toward the balcony, a rope already prepared for a quick descent into the darkness below.","notes":"The players have a decision to make. They could give chase, or go to Thaddeus. If they go to Thaddeus, it is possible they could obtain his key. Regardless, there is nothing they can do to help him—he will die.","npcs":[]},{"name":"The Chase","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726797856154","narrative":"The ballroom explodes into chaos as the assassin rushes out over the balcony. The cool night air rushes against those who they peer over the edge, catching a glimpse of the hooded figure rapidly descending the rope into the darkened garden below. \n\nBeneath the lush greenery and meticulously maintained flower beds, movement can be spotted as the figure disappears through what appears to be an old drainage grate hidden beneath the ivy. The grate, almost indistinguishable from the garden's stone pathways, swings shut with a soft clang, the mechanism hidden beneath the vines.","notes":"If the assassin is somehow prevented from escaping, he will ingest a cyanide capsule. The underground passage will still be discovered as part of the plot.","npcs":[],"stages":[{"name":"Dead End","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726797804541","narrative":"At the end of the narrow, winding passage through which the assassin escaped is a crude wooden door, reinforced with iron bands. Despite its worn appearance, it is sealed impossibly tight. The door seems out of place, its rough craftsmanship in stark contrast to the smooth, ancient stone walls of the tunnel. The faint glow of arcane symbols etched into the wood pulses softly, casting eerie shadows on the walls around it. \n\nA faint hum of magical energy lingers in the air h, the seal shimmering with faint runes, preventing anyone from crossing its threshold. ","notes":"No matter how hard they push, pull, or attempt to force the door, it remains firmly shut, locked by powerful magic. The assassin has fled beyond this barrier, and without the proper means to dispel the seal, the adventurers find themselves temporarily thwarted in their pursuit.\n\nIn the aftermath of the assassination, the once-celebratory atmosphere in the Blackthorn mansion turns to utter panic. Thaddeus Blackthorn lies lifeless, his body crumpled on the ballroom floor, the dark poison having already claimed his life. Guests scream and rush toward the exits, while guards frantically search for the assassin, who has long since disappeared. \n\nIt is possible that in the chaos that the adventurers could have an opportunity to further explore the interior of the mansion as the guards will have their attention elsewhere.","npcs":[],"stages":[]}]}]}]},{"title":"The Covenant of The Cowl","plot":"In the aftermath of the murder of Thaddeus Blackthorn, the secret underground network of tunnels has finally been revealed. A powerful ward has sealed the only entrance.\n\nIn reality, the Covenant of the Cowl is created and led by the Valtor family and its allies amongst Valkaran traditionalists. Their tunnel system is secured by doors locked via the magic of the Key of Ilmarin, only accessible to those who know the secret unlocking divination.\n\nLady Astrid will be hellbent on finding her brother’s murderers. If the adventurers cannot devise a way to breach the entrance, Eamon, the half-elf mage, uses a knock spell to dispel the ward.  She will enlist the aid of the adventurers to accompany her, Eamon and Beric into the underground, potentially promising a handsome reward in return. \n\nNavigating the maze will prove challenging as they encounter resistance from Covenant loyalists inside, ancient magical guardians, a giant spider nest and even the undead of old Valkara.\n\nFinally, they reach the inner sanctum where they will confront the leaders of the Covenant. To their surprise, Joran Antonov removes his cowl to reveal himself as the Champion of the Covenant. He accuses Astrid Blackthorn of crimes against the Valkaran people and the murder of his father. \n\nIn this climax of the adventure, the party must decide whether to expose the Valtor Clan’s underground operations, bring down the Covenant to prevent further bloodshed, or support their radical agenda to preserve Valkaran traditions and oppose the powerful Blackthorn family. The fate of Kordavos—and the balance of power between the Valkarans and Asterians—rests in the adventurers’ hands.\n","scenes":[{"title":"Into the Underground","encounters":[{"name":"The Hunt for the Assassin","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726868134486","narrative":"Lady Astrid, now clad in her ranger gear, steps through the courtyard with renewed purpose, her dark leathers and cloak a stark contrast to the opulence of the Blackthorn mansion. The fury in her eyes remains undimmed, but her attire reflects the shift from a grieving noble to a hardened hunter. The night is cold, and the moonlight casts long shadows as she leads the adventurers along the assassin's escape route.\n\nNear the edge of the estate, where the assassin had vanished, a familiar figure stands by the hidden entrance to the underground tunnels. No longer the well-mannered half-elf scholar they met at the Dragonbone Inn—his robes now carry the weight of a man deeply entrenched in the mystery of Kordavos.\n\nAstrid strides forward, her movements silent and deadly, her eyes never leaving the warded door. \"Eamon,\" she snaps, addressing the half-elf, her voice low but intense. \"The ward. Break it.\" Eamon nods, his hands already moving in intricate gestures, his voice a steady murmur as he begins to unravel the magical seal.\n\nTurning to the adventurers, Astrid's gaze hardens. \"We’ve wasted enough time. This assassin and the Covenant think they can hide behind magic and shadows. But we will find them. We will deliver justice upon them.\" She pauses, her voice dropping to a growl. \"Help me hunt them down. Thaddeus will not die without vengeance.\"","notes":"Astrid is willing to pay a large sum if asked. She will be desperate to find and end this threat to her family.","npcs":[],"stages":[{"name":"Unsealing the Entrance","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726872020005","narrative":"Eamon steps forward, his fingers weaving through the air as he mutters an arcane incantation. The sound of his voice echoes faintly off the stone walls as a shimmer of magical energy ripples across the sealed door. A moment later, a sharp, metallic click reverberates through the air, signaling the release of the lock. Behind him, Astrid’s soldiers stand at attention, their hands gripping the hilts of swords and axes, their faces a mixture of resolve and wariness.\n\nThe warded seal, once glowing with an ethereal light, fades, leaving the door unprotected. Eamon glances at Astrid and the adventurers, his expression tense. \"It’s done,\" he says quietly. \"But whatever’s down there, they won’t be expecting us. Let’s use that to our advantage.\" He steps back as Astrid’s men shift in place, readying themselves for what lies ahead.\n\nAstrid wastes no time. With a nod, she pushes open the door, revealing the dark mouth of the tunnel beyond. The air inside is cool and damp, carrying the musty scent of earth and stone. \"Stay alert,\" she warns, her voice a low whisper as she draws her blade. \"We’ve got the numbers, but they’ve got the advantage. They could be lying in wait. We’re in their territory now.\" She motions to her soldiers to follow her in.","notes":"","npcs":[],"stages":[]}]},{"name":"Into the Catacombs","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726873268984","narrative":"The tunnel stretches on in eerie silence ahead, its long, narrow path carved deep beneath the city. The air is cool and damp, with the faint scent of earth and stone lingering in the stillness. For a while, the parties' careful steps echo softly, but nothing disturbs the peace of the passage. \n\nAfter an initial uneventful exploration, the walls begin to widen slightly, the tunnel opening into a broader section. The dim glow of torchlight flickers ahead, barely visible in the distance. As they draw closer, low voices can be heard, carried by the tunnel’s natural acoustics. \n\nRounding a final bend, they come upon a group of hooded figures from the Covenant of the Cowl. The figures move swiftly, carefully positioning large barrels along the walls. One of them kneels to the ground, tending to a long fuse that snakes across the floor, its end glowing with a faint spark. They work in tense silence, unaware of the adventurers’ approach.\n\nA voice ahead mutters, “Hurry. It’s almost ready. Light the fuse. We’ll collapse the tunnel and seal it behind us.”","notes":"In this encounter, the adventurers have to navigate a tunnel set to be collapsed by members of the Covenant. If the party chooses a stealthy approach, they may overhear the Covenant members discussing their plan to detonate the tunnel. This gives them a chance to gain the upper hand and prevent the collapse before it happens. Successful *Stealth* checks will allow the adventurers to surprise their foes, while a failed check alerts the Covenant, who will immediately attempt to light the fuse. A quick, decisive action or disabling spells can stop the fuse before it's fully lit.\n\nIf the adventurers decide to engage the Covenant in open combat, the enemies will prioritize lighting the fuse as they defend themselves. One Covenant member is tasked with igniting the explosives, creating a race against time. The party will have the chance to stop the fuse from being lit or disarm it before the collapse occurs. If the fuse is lit, the adventurers face a ticking clock scenario, requiring them to act fast. Disarming the explosives may require a *Sleight of Hand* or *Arcana* check, or the use of magic such as *Mage Hand* or *Dispel Magic*. Failure in disarming the explosives will lead to a tense moment as the fuse burns toward detonation.\n\nIf the fuse reaches its end, the adventurers will have to choose between attempting a last-ditch effort to disarm it or escaping the tunnel before it collapses. A successful escape will require *Athletics* or *Dexterity* checks as they flee the explosion. Should the adventurers partially mitigate the damage, the tunnel may only collapse in part, allowing them to move forward with difficulty. However, a complete failure means the tunnel collapses entirely behind them, forcing the party deeper into the unknown. The stakes of this encounter are high, and the adventurers will feel the weight of each decision, knowing that failure could result in being trapped underground or losing their lead in the investigation.","npcs":[]},{"name":"Through the Labyrinth","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726950403113","narrative":"Past the detonation point, the tunnel branches, then again, and again. Each fork leads to another, one blending into the next, with walls that look eerily similar and no obvious landmarks to guide their way. The air is damp, carrying a faint metallic tang. Some tunnels seem freshly dug, while others seem very old, forgotten by time.\n\n“Too many turns,” Astrid mutters in frustration, her brow furrowed as she looks down each corridor. “It’s designed to lose anyone who isn’t supposed to be down here.” \n\nDetermined, she glances back at her men. “Split up,” she commands. “Take smaller teams and explore each of these tunnels. Report back if you find anything of importance. We’ll cover more ground this way.” Without hesitation, several groups of soldiers break off and head down different passageways, their footsteps quickly fading into the distance.\n\nEamon pauses, running his fingers along faint markings on the walls. “The Covenant wanted to make sure no one found their way without help. But magic leaves traces... and I can still sense that there is a core center of power.” As they move deeper, passing through secret entrances leading to hidden chambers beneath noble estates and prominent guildhouses, it becomes clear that the Covenant uses this network for more than smuggling—it’s a web of surveillance. After a sharp turn, the reduced party comes to a dead end, the shadows pressing in around them.","notes":"Perception or Investigation checks to uncover subtle clues about their surroundings. A successful check will reveal faint magical etchings along the walls, which an Arcana check can confirm are part of a surveillance network. These runes are used by the Covenant to spy on important locations in Kordavos, including the City Council chambers. If the players make the connection, they’ll realize the tunnels are not just for smuggling but are integral to the Covenant’s efforts to monitor key figures in the city.\n\nEamon might mutter, \"These runes aren’t just for decoration… they’re transmitting information. The City Council is being watched.\" If the players investigate further, they’ll realize the tunnels serve not just for smuggling but for spying on powerful figures in Kordavos. Astrid, studying the wall, might add, “Thaddeus never saw this coming… the Covenant has eyes everywhere.”","npcs":[]},{"name":"The Sealed Door","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726951147257","narrative":"After what feels like hours of navigating the endless maze of tunnels, the path narrows and ends abruptly at a large, ancient door. Marked with glowing sigils that pulse with arcane power, the door radiates an oppressive, magical force. The air grows colder as they approach, the sigils casting eerie reflections on the stone walls.\n\n“This is it,” Astrid says, her voice steady but grim. “Whatever the Covenant’s been hiding, it’s through that door.”\n\nEamon steps forward, examining the intricate runes etched into the door’s surface. “A powerful seal, just like the last. There is a pattern at work here. I should be able to bypass it like the last, but breaking this will not go unnoticed,” he warns the group.","notes":"","npcs":[],"stages":[]},{"name":"Big Empty","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726951960914","narrative":"The arcane seal dissolves, and the heavy stone door creaks open with a deep rumble, revealing... nothing. Beyond the threshold is a vast, cavernous chamber, its emptiness an anticlimax after the intricate secrecy that guarded it. The ceiling arches high into the darkness, while the rough-hewn stone walls, worn and weathered, suggest great age. At the far end of the chamber, barely visible in the gloom, a narrow passageway leads deeper into the unknown. No treasure, no immediate enemies—just a desolate, echoing space that seems to mock their efforts.\n\nAstrid steps forward, her brow furrowed. \"All this... for *this*?\" she mutters, her voice tinged with frustration. Eamon moves to her side, carefully studying the walls. \"It doesn’t make sense,\" he says, his voice low and thoughtful. \"The Covenant went through great lengths to hide this place... but why? There’s nothing here.\" His eyes shift toward the far exit. \"Perhaps we haven’t seen everything yet.\"","notes":"The players may feel compelled to explore the chamber, searching for anything that would explain its significance. A careful investigation might reveal faint scuff marks on the floor or slight indentations in the walls, suggesting that something large was once stored here but has since been moved. The echoes of their footsteps reinforce the strange emptiness, a hollow reminder of something ancient, now gone.","npcs":[],"stages":[{"name":"Ancient Undead","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726954368228","narrative":"As footsteps echo in the eerie silence of the cavernous chamber, the ground feels unsettlingly soft. Suddenly, the earth shifts ever so slightly. Without warning, a skeletal hand bursts through the surface, its cold, bony fingers reaching for the living. A low, unnatural groan reverberates through the chamber as another skeletal hand breaks through—then another, and another.\n\nThe air grows thick with the musty scent of decay. These are not ordinary undead; their bones are adorned with remnants of old Valkaran armor, rusted but still recognizable. Each figure bears the markings of an ancient time, their cracked skulls and hollow eyes glowing with a faint, unnatural light. These are the cursed remnants of Old Valkara, rising from the grave.\n\nAstrid’s eyes widen in shock as she draws her blade, its steel gleaming in the dim light. \"We’ve been led into a trap!\" she shouts, her voice cutting through the mounting chaos.  The chamber fills with the sound of cracking bones as the army of ancient undead rises from beneath.","notes":"These skeletons are not particularly powerful individually, but they keep coming, forcing the party to think strategically about how to deal with them before becoming overwhelmed. They will not leave the chamber.","npcs":[],"stages":[]}]}]},{"title":"The Inner Sanctum","encounters":[{"name":"Forgotten Temple","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726955916736","narrative":"Astrid wipes the grime from her blade, her eyes narrowing with determination. \"We’re close. The ancient undead were protecting something important.\"\n\nThe narrow, rough-hewn stone passage begins to widen, its texture and shape gradually changing. The crumbling walls give way to smooth, intricately carved stonework, and the air becomes thick with the musty scent of forgotten history. Faded runes and symbols, barely discernible under centuries of grime, begin to appear, etched into the stonework.\n\nAstrid’s voice breaks the heavy silence. She exhales slowly, her eyes wide with both awe and disbelief. \"A lost temple of old Valkara,\" she murmurs, her voice barely above a whisper, \"underneath the city all this time, just waiting to be discovered.\"\n\nTowering pillars frame an arched doorway, their surfaces etched with intricate runes and faded depictions of Valkaran heroes long forgotten. The massive stone door stands partially ajar, revealing only darkness beyond. The carvings on its surface, once vibrant and telling stories of Valkara’s golden age, are now worn down by centuries of erosion. \n\nThe air here is thick with the weight of forgotten history, and a palpable tension fills the musty underground air. ","notes":"","npcs":[]},{"name":"Final Confrontation","image":"https://s3.us-east-1.amazonaws.com/d20-public/images/d20/1726970504298","narrative":"Inside the ancient temple, darkness swallows everything. The air is thick, cold, and utterly still, as if the stone walls themselves are holding their breath. For a moment, there is nothing but the muffled sound of footsteps as the adventurers cautiously step inside, their eyes straining against the oppressive blackness. The sense of foreboding grows with each passing second.\n\nThen, with a sharp flick, a torch is lit. Its flickering flame casts long, dancing shadows against the cold stone walls, revealing the vast interior of the temple. Standing at the center of the grand hall, cloaked in the dim glow of the torch, is a figure draped in dark robes, the unmistakable insignia of the Covenant of the Cowl visible on their chest. Their hood is pulled low, hiding their features, but the voice that greets the adventurers is unnervingly calm, almost welcoming.\n\n\"Welcome,\" the figure says, stepping forward with measured grace. \"I’ve been expecting you. In fact, I’ve been looking forward this for quite some time.\" There’s satisfaction in his voice, as if this moment was all part of a plan unfolding exactly as intended.\n\nAs the figure speaks, more torches ignite around the chamber, one after another. The faint hiss of fire reveals shadowed figures standing at the perimeter, each one cloaked in the same dark robes, their faces obscured but their presence unmistakable. The room, once dark and empty, now pulses with an ominous energy as more members of the Covenant of the Cowl step forward. Silent and foreboding, they watch with cold intensity, their numbers slowly revealed in the flickering torchlight.\n\n\"You see, you’ve walked right into the heart of it. And now, you stand before those who have shaped everything you’ve encountered. There is no escape. The only question now is… what will you do?\"","notes":"","npcs":[],"stages":[{"name":"Joran Antonov","image":"","narrative":"As the flickering torches illuminate the vast temple, the tension in the air becomes almost suffocating. Astrid, her posture rigid and her eyes ablaze with defiance, steps forward. Her men, loyal and ready, gather behind her, their weapons drawn. The Blackthorn soldiers fan out, their armor gleaming in the low light, creating a stark contrast to the shadowy, robed figures of the Covenant of the Cowl.\n\nAstrid’s voice cuts through the tense atmosphere like a blade, sharp and resolute. “You think this ends with some pathetic show of force? You underestimate the strength of the Blackthorn family.” She glares at the hooded figure at the center of the chamber. “We’ve built our power through blood and fire, and we will not be brought down by your cowardice.”\n\nAt that, the cloaked figure at the center steps forward. Slowly, the figure pulls back his hood, revealing his face. There is no mistaking who he is.\n\nHis eyes lock with Astrid’s, cold and filled with a vengeful fire. “Cowardice?” His voice is calm, measured, but laced with contempt. “I’ve had the courage to do what needed to be done. Thaddeus was a parasite, preying on our people, exploiting our history.” He pauses, allowing the weight of his words to hang in the air. Then, with a chilling smile, he adds, “And I know you stole my father’s journal, Astrid. That was my legacy, not yours.”\n\nAstrid’s grip tightens on her sword as she steps forward, her face set in a mask of fury. “Your father was a fool. And you? You’re just a puppet for the Valtors. Do you even realize what you’ve done?” She gestures to the adventurers, a mixture of desperation and fury in her voice. “These people deserve better than your lies and betrayal.”\n\nJoran takes a step closer, his eyes scanning the group of adventurers at Astrid’s side, who were also allied with his sister. \n\n“It’s time to choose. The Blackthorn’s hunger for power will destroy Valkara. Join me, and we can rebuild our people and purge the Asterian interlopers. Or stand with Astrid and be crushed under the weight of their greed.” His gaze shifts back to Astrid, the tension crackling between them like lightning. ","notes":"The adventurers now stand at a crossroads, watching the scene unfold. Both sides have laid bare their intentions, and the choice before them feels heavier than ever. Astrid, defiant and proud, leads the Blackthorn family with a ruthless determination. Joran, driven by vengeance and the pursuit of his father’s legacy, has revealed the depths of the Covenant’s influence.\n\nWill they stand with the Blackthorns, preserving the fragile alliance with the Asterians and securing their own wealth and power? Or will they side with Joran, embracing the Covenant’s vision of an independent Valkara—at any cost?","npcs":[],"stages":[]}]}]}]}],"summary":"The March of Davos is a land of contrasts and conflicts, where the ancient traditions of the Valkaran people clash with the ambitions of the Asterian Empire. Nestled in the southern regions of Thylún, this rugged frontier is a place of wild beauty and hidden dangers. The capital city, Kordavos, stands as a beacon of civilization on the edge of the untamed lands, a bustling port where cultures and ideas converge. It is a place where adventurers are drawn by the promise of fortune and the allure of secrets waiting to be uncovered at the edge of civilization and wild ancient land.\n\nInside the gates, travelers and locals alike gather at the annual Valkaran Harvest Festival, and tension between rival clan factions erupts, drawing the adventurers into the fray. Afterward, as they settle in at a tavern, their intervention catches the attention of several locals. \n\nThey are approached by a half elf named Eamon and his bodyguard Beric and presented with the opportunity to investigate a missing shipment at the docks. \n\nLater in the morning, they encounter another in need. An acquaintance of the innkeeper, Elara Antonov is a desperate woman who pleads for their help in finding her missing brother, Joran, who was obsessed with finding the truth about their father’s mysterious death.\n\nAs they pursue these quests, navigating the labyrinthine streets and eclectic districts of Kordavos, they draw the attention of three powerful clan families.\n\nThe Valtor Clan, led by the formidable Matriarch Seraphina Valtor, is deeply connected to ancient Valkaran traditions and the Valkaran Church. The family controls vast forests around Kordavos and fiercely defends their ancestral lands. They are often at odds with the Asterian settlers, whom they see as desecrators of the natural world. Their influence in the city extends through green spaces and a network of rangers and druids who safeguard Valkaran interests.\n\nThe Blackthorn Clan, led by Patriarch Thaddeus Blackthorn, has embraced the Asterian way of life and become one of the wealthiest families in Kordavos. Originally known as Drakovan, a traditional Valkaran family name, they rebranded themselves as Blackthorn to align more closely with Asterian customs and gain favor with the Empire’s elite. The family controls key trade routes and merchant fleets, using their wealth and political clout to influence decisions in the city. Their mansion stands as a symbol of opulence and power at the heart of Kordavos.\n\nThe Raskov Clan, known for their opportunism, walks the line between Valkaran traditions and Asterian influence. They are expert manipulators, often playing both sides for personal gain. In the shadows, they operate as smugglers and traders, with deep connections in the city’s underworld and political circles. Initially, suspicion for the missing shipment falls on the Raskov Clan due to their history of shady dealings.\n\nAs the investigation deepens, the adventurers begin to uncover cryptic symbols and mysterious clues pointing to a secretive organization known as the Covenant of the Cowl that seems to have orchestrated the theft, but it’s unclear whom they serve. They operate in the shadows, manipulating events in Kordavos for reasons unknown. Many suspect they are aligned with the Raskov Clan, given its history of working in the underworld.\n\nThrough investigation and a series of dangerous encounters, the adventurers eventually find themselves invited to a masquerade ball hosted by the Blackthorn Clan, where they have a chance to gather intelligence from the city’s elite. During the event, the adventurers must navigate political intrigue, question alliances and probe for more clues.\n\nA shocking murder at the ball leads to the revelation that the Covenant has established an underground network of tunnels for the purposes of operating in secret and conducting espionage throughout the city.\n\nNot merely a rogue faction, the Covenant of the Cowl is secretly the underground wing of the Valtor Clan. Its true purpose is to maintain Valkaran dominance by undermining the Blackthorns’ alignment with the Asterians and any foreign influence in Kordavos. They stole the shipment to gain the upper hand and disrupt the Asterians' control.\n\nElara’s missing brother Joran becomes central to the plot. Once torn between his loyalty to his family’s traditional values and the darker methods of the Covenant, he determined that his father Milos had been murdered by the Blackthorn family in order to rob him of his research into ancient Valkaran lore.\n\nInitially believed to be a victim, he has in fact been indoctrinated and trained as a paladin of the old ways of Valkara and now, holding the Key of Ilmarin, is the operational leader of Covenant operations. It was Joran who organized the operation to betray Kazimir “Silverhand” Raskov and steal the Key of Ilmarin, an artifact that has the power to magically secure or unlock openings of any kind.\n\nIn this climax of the adventure, the party must decide whether to expose the Valtor Clan’s underground operations, bring down the Covenant to prevent further bloodshed, or support their radical agenda to preserve Valkaran traditions and oppose the powerful Blackthorn family. The fate of Kordavos—and the balance of power between the Valkarans and Asterians—rests in the adventurers’ hands.\n"}